let montazhNaladkaData = [
  {
    question:
      "На каком максимальном расстоянии от верха дверных проемов эвакуационных выходов возможно устанавливать световые указатели «Выход»?",
    answers: {
      a: "не более 0,7 м",
      b: "не более 0,5 м",
      c: "не более 0,1 м",
    },
    description:
      "СН 2.02.03-2019 Пожарная автоматика зданий и сооружений (утв. пост. Министерства архитектуры и строительства от 29 ноября 2019 г. № 64). Пункт 12.12.13",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Что является итоговым действием при наладке систем ПА по завершении всех монтажных и наладочных работ (операций):",
    answers: {
      a: "пуско-наладочные работы",
      b: "комплексное опробование",
      c: "работы по регулировке, настройке",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 32.",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "О факте прохождения средств обеспечения пожарной безопасности и пожаротушения входного контроля, в ходе которого не установлено несоответствий учиняется соответствующая запись, которая заверяется подписью лица, его проводившего в:",
    answers: {
      a: "в спецификациях проекта",
      b: "в эксплуатационном документе такой продукции",
      c: "в проектной документации",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 4",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "На каком расстоянии от уровня пола проводится измерение уровня звука?",
    answers: {
      a: "1,75 м",
      b: "1 м",
      c: "1,5 м",
    },
    description:
      "СН 2.02.03-2019 Пожарная автоматика зданий и сооружений (утв. пост, Министерства архитектуры и строительства от 29 ноября 2019 г. № 64). Пункт 12.12.16",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В период наладки отдельных элементов систем ПА должны проводится",
    answers: {
      a: "работы (операции) по настройке, регулировке, юстировке и испытания элементов систем ПА",
      b: "работы по настройке, регулировке элементов систем ПА",
      c: "операции по юстировке и испытаниям элементов систем ПА",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 31",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Выполнение работ и (или) оказание услуг по монтажу СО должны осуществляться в соответствии с:",
    answers: {
      a: "разработанной, утвержденной и согласованной в установленном порядке проектной документацией",
      b: "эксплуатационными документами на элементы этих систем пожарной автоматики",
      c: "разработанной, утвержденной и согласованной в установленном порядке проектной документацией, а также эксплуатационными документами на элементы этих систем пожарной автоматики с учетом требований ТНПА",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 26",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "После завершения наладки систем ПА в целом лицензиатом, выполнившим их монтаж, должен быть оформлен:",
    answers: {
      a: "акт проведения комплексного опробования системы пожарной автоматики",
      b: "акт первичного обследования системы пожарной автоматики",
      c: "паспорт системы пожарной автоматики",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 31",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Предельно допустимый уровень звукового давления звуковых оповещателей в защищаемых СО помещениях, где люди находятся в шумозащитном снаряжении, или в помещениях с уровнем фона шума более 95 дБ, не должен превышать:",
    answers: {
      a: "100 дБ",
      b: "120 дБ",
      c: "110 дБ",
    },
    description:
      "СН 2.02.03-2019 Пожарная автоматика зданий и сооружений (утв. пост. Министерства архитектуры и строительства от 29 ноября 2019 г. № 64). Пункт 12.12.9",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Эксплуатационные документы — это...",
    answers: {
      a: "документы, определяющие правила и порядок эксплуатации систем ПА в течение установленного срока службы",
      b: "документы, определяющие правила и порядок эксплуатации систем ПА и (или) их элементов в течение установленного срока службы",
      c: "документы, определяющие правила эксплуатации систем ПА и (или) их элементов в течение установленного срока службы",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 2",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Звуковой сигнал звукового оповещателя должен обеспечивать:",
    answers: {
      a: "быть отличным от других сигналов",
      b: "однозначное восприятие и быть отличным от других сигналов",
      c: "однозначное восприятие",
    },
    description:
      "СТБ 2243-2011 «Система стандартов пожарной безопасности. Оповещатели пожарные. Общие технические условия». Подпункт п. 53.1",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Поступившие в монтаж элементы ПА должны храниться в соответствии с:",
    answers: {
      a: "эксплуатационными документами",
      b: "требованиям ТНПА",
      c: "проектной документацией",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 28",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Для запуска СО в помещениях с массовым пребыванием людей следует применять:",
    answers: {
      a: "СПС только с тепловыми ПИ",
      b: "СПС только с дымовыми ПИ",
      c: "СПС без тепловых ПИ",
    },
    description:
      "СН 2.02.03-2019 Пожарная автоматика зданий и сооружений (утв. пост. Министерства архитектуры и строительства от 29 ноября 2019 г. № 64). Пункт 12.12.19",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Соединительные линии — это...",
    answers: {
      a: "провода и кабели, обеспечивающие соединение компонентов пожарных приборов управления, а также пожарных приборов управления с другими элементами систем ПА, в том числе с электрическими сетями",
      b: "кабели, обеспечивающие соединение компонентов пожарных приборов управления, а также пожарных приборов управления с другими элементами систем ПА, в том числе с электрическими сетями",
      c: "провода и кабели, обеспечивающие соединение компонентов пожарных приборов управления, а также пожарных приборов управления с другими элементами систем ПА",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 2",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "РПИ необходимо устанавливать в местах, имеющих искусственное освещение...",
    answers: {
      a: "не менее 10 лк",
      b: "не менее 30 лк",
      c: "не менее 20 лк",
    },
    description:
      "СН 2.02.03-2019 Пожарная автоматика зданий и сооружений (утв. пост. Министерства архитектуры и строительства от 29 ноября 2019 г. № 64). Пункт 12.10.3",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "По завершении монтажа соединительных линий:",
    answers: {
      a: "оформляется соответствующий акт",
      b: "замеряется сопротивление изоляции",
      c: "измеряется сопротивление изоляции и оформляется соответствующий акт",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 30",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "На сколько видов по характеру выдаваемых сигналов подразделяют оповещатели?",
    answers: {
      a: "6",
      b: "4",
      c: "5",
    },
    description:
      "СТБ 2243-2011 Система стандартов пожарной безопасности. Оповещатели пожарные. Общие технические условия. (утв. постановлением Государственного комитета по стандартизации Республики Беларусь от 22 декабря 2011 г. № 94) Подпункт 4.1.1 пункта 4",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Перечень оборудования, приборов (средств измерений) и инструментов, необходимых для выполнения работ и (или) оказания услуг по монтажу и наладке СО, установлен:",
    answers: {
      a: "постановлением МЧС от 14.12.2022 № 78",
      b: "постановлением МЧС от 14.12.2022 № 77",
      c: "постановлением МЧС от 09.12.2022 № 75",
    },
    description:
      "Постановление Министерства по чрезвычайным ситуациям от 9 декабря 2023 г. № 75 О перечне оборудования, приборов (средств измерений) и инструментов",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Кто осуществляет входной контроль средств обеспечения пожарной безопасности и пожаротушения:",
    answers: {
      a: "ответственное лицо (лица) из числа технических руководителей, назначенное (ые) приказом руководителя лицензиата",
      b: "начальник участка",
      c: "производитель работ",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 4",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Элементы систем ПА, применяемые при монтаже СО должны соответствовать:",
    answers: {
      a: "требованиям ТНПА",
      b: "эксплуатационным документам",
      c: "спецификациям проекта",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 27",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "С какой периодичностью осуществляется обучение, повышение квалификации работников лицензиата?",
    answers: {
      a: "не реже одного раза в пять лет",
      b: "не реже одного раза в три года",
      c: "по мере необходимости, но не реже одного раза в пять лет",
    },
    description:
      "Инструкции об порядке обучения (повышения квалификации) и оценки знаний работников соискателей лицензии на осуществление деятельности по обеспечению пожарной безопасности, лицензиатов, осуществляющих деятельность по обеспечению пожарной безопасности» утверждено постановлением Министерства по чрезвычайным ситуациям Республики Беларусь от 14 декабря 2022 г. № 79 Пункт 6",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Пожарные оповещатели по видам сигналов оповещения подразделяются на:",
    answers: {
      a: "световые, звуковые, речевые, комбинированные",
      b: "шумовые, звуковые, речевые, комбинированные",
      c: "световые, звуковые, фонограммные, совмещенные",
    },
    description:
      "СТБ 2243-2011 «Система стандартов пожарной безопасности, Оповещатели пожарные. Общие технические условия». Подпункт 41.1, пункта 4",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Каждое средство обеспечения пожарной безопасности и пожаротушения, подлежащее обязательной оценке соответсвия, перед установкой (применением) в составе СО должно:",
    answers: {
      a: "пройти входной контроль и идентификацию",
      b: "пройти входной контроль",
      c: "пройти идентификацию",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 4",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Дополнительно к автоматическому включению СО должно предусматриваться включение:",
    answers: {
      a: "не должно предусматриваться",
      b: "от РПИ при отсутствии на объекте пожарного поста",
      c: "от РПИ при наличии на объекте пожарного поста",
    },
    description:
      "СН 2.02.03-2019 Пожарная автоматика зданий и сооружений (утв. пост, Министерства архитектуры и строительства от 29 ноября 2019 г. № 64). Пункт 12.12.22",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Для какого типа систем оповещения и управления эвакуацией людей при пожаре требуется связь зоны оповещения с диспетчерской?",
    answers: {
      a: "СО-1, СО-2",
      b: "СО-4, СО-5",
      c: "СО-2, СО-3",
    },
    description:
      "СН 2.02.03-2019 Пожарная автоматика зданий и сооружений (утв. пост. Министерства архитектуры и строительства от 29 ноября 2019 г. № 64). Приложение С Таблица С.",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "В помещениях с массовым пребыванием людей световые указатели «Выход» и световые указатели обозначающие маршруты движения при эвакуации должны?",
    answers: {
      a: "гореть постоянно",
      b: "включаться до начала проведения мероприятия",
      c: "включаться на время пребывания людей",
    },
    description:
      "СН 2.02.03-2019 Пожарная автоматика зданий и сооружений (утв. пост, Министерства архитектуры и строительства от 29 ноября 2019 г. № 64). Пункт 12.12.13",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "На какой минимальной высоте возможно устанавливать световые указатели, обозначающие маршруты движения?",
    answers: {
      a: "2,2",
      b: "1,7",
      c: "2,0",
    },
    description:
      "СН 2.02.03-2019 Пожарная автоматика зданий и сооружений (утв. пост, Министерства архитектуры и строительства от 29 ноября 2019 г. № 64). Пункт 12.12.13",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "В каком случае не требуется оборудовать звуковыми оповещателями помещение?",
    answers: {
      a: "если смежное сним помещение оборудовано звуковыми оповещателями и имеет сообщение через одну дверь, при этом уровень звукового давления следует увеличивать на 8 дБ",
      b: "если смежное с ним помещение оборудовано звуковыми оповещателями и имеет сообщение через одну дверь, при этом уровень звукового давления следует увеличивать на 10 дБ",
      c: "если смежное с ним помещение оборудовано звуковыми оповещателями и имеет сообщение через двойную дверь, при этом уровень звукового давления следует увеличивать на 10 дБ",
    },
    description:
      "СН 2.02.03-2019 Пожарная автоматика зданий и сооружений (уте. пост. Министерства архитектуры и строительства от 29 ноября 2019 г. № 64). Пункт 12.12-9 6",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Расстояние от эвакуационных выходов из помещений до ближайшего РПИ на путях эвакуации не может превышать?",
    answers: {
      a: "30 м",
      b: "20 м",
      c: "40 м",
    },
    description:
      "СН 2.02.03-2019 Пожарная автоматика зданий и сооружений (утё. пост. Министерства архитектуры и строительства от 29 ноября 2019 г. № 64). Пункт 12.10.1",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "При выполнении работ по монтажу СО лицензиат обязан:",
    answers: {
      a: "вести документацию, составляемую по результатам выполнения таких работ, предусмотренную ТНПА в области архитектурной, градостроительной и строительной деятельности",
      b: "вести документацию, составляемую в ходе и по результатам выполнения таких работ, предусмотренную ТНПА в области архитектурной, градостроительной и строительной деятельности",
      c: "вести документацию, составляемую в ходе выполнения таких работ, предусмотренную ТНПА в области архитектурной, градостроительной и строительной деятельности",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 29",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "По конструктивному исполнению оповещатели подразделяются на...",
    answers: {
      a: "активные, пассивные, активно-пассивные",
      b: "активные, пассивные",
      c: "активные, пассивные, совмещенные",
    },
    description:
      "СТБ 2243-2011 Система стандартов пожарной безопасности. Оповещатели пожарные. Общие технические условия». Подпункт 4.1.2 пункта 4",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Система оповещения и управления эвакуацией людей при пожаре по ТР ЕАЭС 043/2017, это ...",
    answers: {
      a: "Устройства формирования, преобразования, передачи и воспроизведения электрических сигналов (световых, звуковых, речевых) в одном или нескольких видах, непосредственно воспринимаемых человеком",
      b: "Совокупность технических средств, предназначенных для сообщения людям информации о возникновении пожара или другой чрезвычайной ситуации, и порядке действий при эвакуации",
      c: "Совокупность технических средств, предназначенных для информирования людей о возникновении пожара, необходимости эвакуироваться, путях и очередности эвакуации",
    },
    description:
      "Технический регламент Евразийского экономического союза «О требованиях к средствам обеспечения пожарной безопасности и пожаротушения» (ТР ЕАЭС 043/2017). Раздел 1, пункт 6",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Какая минимальная высота размещения оповещателей от уровня пола до его нижней части при которой не следует предусматривать защиту от механического повреждения?",
    answers: {
      a: "1,8 м",
      b: "2,2 м",
      c: "2,0 м",
    },
    description:
      "СН 2.02.03-2019 Пожарная автоматика зданий и сооружений (утё. пост. Министерства архитектуры и строительства от 29 ноября 2019 г. № 64). Пункт 12.12-9 в",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Пожарные оповещатели классифицируются по:",
    answers: {
      a: "назначению, типу сигнала оповещения, наличию встроенных схем преобразования энергии, виду управления, виду питания, классу защиты от поражения электрическим током, эксплуатационному и монтажному положению, условиям применения, гарантийному сроку эксплуатации",
      b: "видам сигнала оповещения, конструктивному исполнению, месту размещения при эксплуатации",
      c: "назначению, типу сигнала оповещения, наличию, виду управления, виду питания, классу защиты от поражения электрическим током, эксплуатационному положению, условиям применения",
    },
    description:
      "СТБ 2243-2011 «Система стандартов пожарной безопасности. Оповещатели пожарные. Общие технические условия». Подпункт 4.1 пункта 4",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "По месту размещения при эксплуатации оповещатели подразделяются на...",
    answers: {
      a: "- оповещатель пожарный, предназначенный для применения внутри помещения;<br>- оповещатель пожарный, предназначенный для применения вне помещения;<br>- оповещатель пожарный, предназначенный для применения в пожароопасных зонах внутри и вне помещений",
      b: "- оповещатель пожарный, предназначенный для применения внутри помещения;<br>- оповещатель пожарный, предназначенный для применения вне помещения;<br>- оповещатель пожарный, предназначенный для применения во взрывоопасных зонах внутри помещений",
      c: "- оповещатель пожарный, предназначенный для применения внутри помещения;<br>- оповещатель пожарный, предназначенный для применения вне помещения;<br>- оповещатель пожарный, предназначенный для применения во взрывоопасных зонах внутри и вне помещений",
    },
    description:
      "СТБ 2243-2011 «Система стандартов пожарной безопасности. Оповещатели пожарные. Общие технические условия». Подпункт п. 4.1.3 пункта 4",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Оповещатели в зависимости от расположения должны иметь степень защиты, обеспечиваемой оболочкой от:",
    answers: {
      a: "доступа к опасным частям",
      b: "доступа к опасным частям, попадания внешних твердых предметов и воды",
      c: "попадания внешних твердых предметов и воды",
    },
    description:
      "СТБ 2243-2011 «Система стандартов пожарной безопасности. Оповещатели пожарные. Общие технические условия». Подпункт п. 6.1.1",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Световые указатели, обозначающие маршруты движения при эвакуации, должны питаться по:",
    answers: {
      a: "II категории надежности",
      b: "I категории надежности",
      c: "III категории надежности",
    },
    description:
      "СН 2.02.03-2019 Пожарная автоматика зданий и сооружений (утв. пост. Министерства архитектуры и строительства от 29 ноября 2019 г. № 64). Пункт 12.12.3",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "В пределах одного помещения или коридора, вестибюля, холла и фойе следует применять вытяжную противодымную вентиляцию...",
    answers: {
      a: "с естественным или искусственным побуждением",
      b: "только с искусственным побуждением",
      c: "только с естественным побуждением",
    },
    description:
      "СН 2.02.07-2020 Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 5.9",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Максимальная площадь резервуара дыма составляет:",
    answers: {
      a: "3000 м2",
      b: "4000 м2",
      c: "1600 м2",
    },
    description:
      "СН 2.02.07-2020 Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 6.1",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Элементы систем ПА, применяемые при монтаже систем противодымной вентиляции должны соответствовать:",
    answers: {
      a: "требованиям ТНПА",
      b: "эксплуатационным документам",
      c: "спецификациям проекта",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 27",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Для систем вытяжной противодымной вентиляции при удалении продуктов горения для коридоров, вестибюлей, холлов и фойе дымовые клапаны следует предусматривать с пределом огнестойкости не менее...",
    answers: {
      a: "Е 15",
      b: "Е З0",
      c: "Е 60",
    },
    description:
      "СН 2.02.07-2020 Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 5.14",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "На воздуховодах, обслуживающих помещение, защищаемое установками газового, аэрозольного или порошкового пожаротушения, следует предусматривать противопожарные клапаны с пределом огнестойкости не менее .. (закончить утверждение)",
    answers: {
      a: "EI 60",
      b: "EI 15",
      c: "EI 30",
    },
    description:
      "СН2.02.07-2020 Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 5.16",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Для систем вытяжной противодымной вентиляции при удалении продуктов горения непосредственно из обслуживаемых помещений дымовые клапаны следует предусматривать с пределом огнестойкости не менее:",
    answers: {
      a: "EI 30",
      b: "EI 45",
      c: "EI 15",
    },
    description:
      "СН2.02.07-2020 Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 5.14",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "При отсутствии данных об объемном расходе воздуха в клапане дымоудаления нижнего жилого этажа для зданий постройки 1971 - 1984 годов следует принимать:",
    answers: {
      a: "5550 куб.м/ч",
      b: "7550 куб.м/ч",
      c: "10000 куб.м/ч.",
    },
    description:
      "НПБ 23-2010 Противодымная защита зданий и сооружений. Методы приемо-сдаточных и периодических испьтаний. П.24",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Определение аэродинамических характеристик при приемо-сдаточных и периодических испытаниях систем противодымной защиты на соответствие требованиям ТНПА должны проводиться",
    answers: {
      a: "Органом ГПН",
      b: "Испытательными лабораториями, аккредитованными в системе аккредитации Республики Беларусь на право выполнения аэродинамических испытаний систем противодымной защиты",
      c: "Специализированными организациями, имеющими лицензию Министерства по чрезвычайным ситуациям Республики Беларусь на право выполнения работ по монтажу, наладке и техническому обслуживанию указанных систем",
    },
    description:
      "НПБ 23-2010 Противодымная защита зданий и сооружений. Методы приемо-сдаточных и периодических испьтаний. П. 12",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Приемо-сдаточные и периодические испытания систем противодымной защиты зданий на соответствие требованиям ТНПА должны проводиться",
    answers: {
      a: "Испытательными лабораториями, аккредитованными в системе аккредитации Республики Беларусь на право выполнения аэродинамических испытаний систем противодымной защиты:",
      b: "Специализированными организациями, имеющими лицензию Министерства по чрезвычайным ситуациям Республики Беларусь на право выполнения работ по монтажу и (или) наладке указанных систем",
      c: "Органом ГПН",
    },
    description:
      "НПБ 23-2010 Противодымная защита зданий и сооружений. Методы приемо-сдаточных и периодических испьтаний. П. 12",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Дымовая зона — это... (дать определение)",
    answers: {
      a: "помещение площадью не более 3000 м2, из которого удаляется дымовая смесь в объеме, обеспечивающем безопасную эвакуацию людей при пожаре",
      b: "помещение или часть помещения площадью не более 3000 м2, из которого удаляется дымовая смесь в объеме, обеспечивающем безопасную эвакуацию людей при пожаре",
      c: "помещение или часть помещения площадью не более 2000 м2, из которого удаляется дымовая смесь в объеме, обеспечивающем безопасную эвакуацию людей при пожаре",
    },
    description:
      "СН 2.02.07-2020 «Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 3.6",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Приспособления для ручного открывания оконных проемов, предназначенных для обеспечения естественного проветривания, следует устраивать на высоте:",
    answers: {
      a: "не более чем 1,7 м отуровня пола",
      b: "не нормируется",
      c: "не более чем 1,5 м от уровня пола",
    },
    description:
      "СН 2.02.07-2020 Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 5.12",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "С какой периодичностью проводят периодические испытания систем противодымной защиты?",
    answers: {
      a: "не реже одного раза в 3 года",
      b: "не реже одного раза в год",
      c: "не реже одного раза в 2 года",
    },
    description:
      "НПБ 23-2010 Противодымная защита зданий и сооружений. Методы приемо-сдаточных и периодических испьтаний. П.8",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Электроустановки системы противодымной вентиляции следует предусматривать по ... категории надежности электроснабжения. (выбрать пропущенное)",
    answers: {
      a: "I",
      b: "II",
      c: "III",
    },
    description:
      "СН 2.02.07-2020 Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 9.2",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Площадь помещений (кроме коридора), обслуживаемую одним дымонепрницаемым устройством, следует принимать:",
    answers: {
      a: "не более 3000 м2",
      b: "не более 2000 м2",
      c: "не более 1000 м2",
    },
    description:
      "СН2.02.07-2020 «Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 5.6",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "При проведении периодических испьтаний систем противодымной защиты следует проверять прохождение сигналов от автоматических пожарных извещателей и кнопок дистанционного включения, причем",
    answers: {
      a: "для проверки работоспособности произвольно выбирают не менее 10% от числа названных извещателей и кнопок",
      b: "для проверки работоспособности произвольно выбирают не менее 20% от числа названных извещателей и кнопок",
      c: "для проверки работоспособности произвольно выбирают не менее 15% от числа названных извещателей и кнопок",
    },
    description:
      "НПБ 23-2010 Противодымная защита зданий и сооружений. Методы приемо-сдаточных и периодических испытаний. П. 14.1",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Следует ограждать (для защиты от доступа посторонних лиц) вентиляторы для систем вытяжной противодымной вентиляции, устанавливаемые на...",
    answers: {
      a: "эксплуатируемой кровле и на наружных стенах на высоте менее 1,9 м от кровли или уровня земли",
      b: "эксплуатируемой кровле и на наружных стенах на высоте менее 2 м от кровли или уровня земли",
      c: "эксплуатируемой кровле",
    },
    description:
      "СН 2.02.07-2020 Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 5.15",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Все измерения при аэродинамических испытаниях систем противодымной защиты выполняют не ранее чем через...",
    answers: {
      a: "5 мин после создания в здании ситуации соответствующую параметрам расчета, предусмотренным действовавшими в период приемки в эксплуатацию здания (системы противодымной защиты) нормативными документами и включения вентиляторов системы противодымной защиты",
      b: "10 мин после создания в здании ситуации соответствующую параметрам расчета, предусмотренным действовавшими в период приемки в эксплуатацию здания (системы противодымной защиты) нормативными документами и включения вентиляторов системы противодымной защиты",
      c: "15 мин после создания в здании ситуации соответствующей параметрам расчета, предусмотренным действовавшим на момент приемки в эксплуатацию здания (системы противодымной защиты) ТНПА, и включении вентиляторов системы противодымной защиты",
    },
    description:
      "НПБ 23-2010 Противодымная защита зданий и сооружений. Методы приемо-сдаточных и периодических испьтаний. П.20",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Радиус действия дымоприемного устройства следует принимать:",
    answers: {
      a: "не более 18 м",
      b: "не более 15 м",
      c: "не более 20 м",
    },
    description:
      "СН 2.02.07-2020 «Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 5.6",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Приемо-сдаточные испытания систем противодымной защиты проводятся:",
    answers: {
      a: "при приемке в эксплуатацию вновь строящихся, реконструируемых и ремонтируемых зданий",
      b: "при завершении капитального и восстановительного ремонта систем противодымной защиты",
      c: "при приемке в эксплуатацию вновь строящихся, реконструируемых и ремонтируемых зданий, а также при завершении капитального и восстановительного ремонта систем противодымной защиты",
    },
    description:
      "НПБ 23-2010 Противодымная защита зданий и сооружений. Методы приемо-сдаточных и периодических испытаний. П.5",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Система противодымной вентиляции по ТР ЕАЭС 043/2017, это ...",
    answers: {
      a: "автоматически и дистанционно управляемая вентиляционная система, предназначенная для удаления продуктов горения при пожаре через дымоприемное устройство или дымовой люк наружу здания",
      b: "совокупность технических средств, предназначенных для предотвращения или ограничения опасности задымления зданий и сооружений при пожаре",
      c: "совокупность взаимодействующих технических средств, предназначенных для предотвращения или ограничения опасности задымления зданий и сооружений при пожаре, а также воздействия опасных факторов пожара на людей и материальные ценности",
    },
    description:
      "Технический регламент Евразийского экономического союза «О требованиях к средствам обеспечения пожарной безопасности и пожаротушения» (ТР ЕАЭС 043/2017). Раздел 1, пункт 6",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Управление противодымной вентиляцией должно обеспечивать опережающее включение вытяжной противодымной вентиляции на ... относительно момента запуска приточной противодымной вентиляции (выбрать пропущенное)",
    answers: {
      a: "10-20 с",
      b: "10 с",
      c: "20-30 с",
    },
    description:
      "СН 2.02.07-2020 Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 9.5",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Для уплотнения разъемных, в том числе фланцевых соединений, воздуховодов систем противодымной вентиляции следует использовать материалы группы:",
    answers: {
      a: "НГ или Г1",
      b: "НГ",
      c: "Г1",
    },
    description:
      "СН 2.02.07-2020 Противодымная защита зданий и сооружений при пожаре, Системы вентиляции. П. 8.1",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Каким образом при удалении продуктов горения следует размещать дымонепроницаемые устройства на шахтах (воздуховодах) коридора, вестибюля, холла и фойе?",
    answers: {
      a: "верхняя кромка дымонепроницаемого устройства должна быть ниже верхнего уровня дверных проемов эвакуационных выходов, нижняя не ниже 1,7 м от уровня пола",
      b: "верхняя кромка дымонепроницаемого устройства должна быть не ниже верхнего уровня дверных проемов эвакуационных выходов, нижняя не ниже 1,7 м от уровня пола",
      c: "верхняя кромка дымонепроницаемого устройства должна быть не ниже верхнего уровня дверных проемов эвакуационных выходов, нижняя не ниже 1,8 м отуровня пола",
    },
    description:
      "СН 2.02.07-2020 «Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 5.6",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Дымовой люк — это... (дать определение):",
    answers: {
      a: "автоматически и дистанционно управляемое устройство, открывающее проемы в наружных ограждающих конструкциях помещений, защищаемых вытяжной противодымной вентиляцией с естественным побуждением тяги",
      b: "автоматически и дистанционно управляемое устройство, открывающее проемы в наружных ограждающих конструкциях помещений, защищаемых вытяжной противодымной вентиляцией с искуственным побуждением тяги",
      c: "автоматически управляемое устройство, открывающее проемы в наружных ограждающих конструкциях помещений, защищаемых вытяжной противодымной вентиляцией с естественным побуждением тяги",
    },
    description:
      "СН 2.02.07-2020 Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 3.5",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "При проведении периодических испьтаний систем противодымной защиты, перепад давления на закрытых дверях путей эвакуации должен быть:",
    answers: {
      a: "Не более 170 Па",
      b: "Не более 120 Па",
      c: "Не более 150 Па",
    },
    description:
      "НПБ 23-2010 Противодымная защита зданий и сооружений. Методы приемо-сдаточных и периодических испьтаний. П.9, табл. 2",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Каждое средство обеспечения пожарной безопасности и пожаротушения, подлежащее обязательной оценке соответствия, перед установкой (применением) в составе систем противодымной вентиляции должно:",
    answers: {
      a: "пройти идентификацию",
      b: "пройти входной контроль и идентификацию",
      c: "пройти входной контроль",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 4",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Каким образом при удалении продуктов горения следует размещать дымонепроницаемые устройства на шахтах (воздуховодах) помещения?",
    answers: {
      a: "нижняя кромка дымонепроницаемого устройства должна быть не ниже нижней границы дымовой зоны (резервуара дыма)",
      b: "нижняя кромка дымонепроницаемого устройства должна быть ниже нижней границы дымовой зоны (резервуара дыма)",
      c: "верхняя кромка дымонепроницаемого устройства должна быть не ниже нижней границы дымовой зоны (резервуара дыма)",
    },
    description:
      "СН 2.02.07-2020 «Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 5.6",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "При проведении приемо-сдаточных испьпаний систем противодымной защиты фактические значения избыточного давления воздуха на нижних этажах лестничных клеток типа Н2 (секций лестничных клеток), в шахтах лифтов, в тамбур-шлюзах должны быть:",
    answers: {
      a: "Не менее 50 Па (при пересчете на условия функционирования)",
      b: "Не менее 20 Па (при пересчете на условия функционирования)",
      c: "Не менее 30 Па (при пересчете на условия функционирования)",
    },
    description:
      "НПБ 23-2010 Противодымная защита зданий и сооружений. Методы приемо-сдаточных и периодических испьтаний. П. 7, табл. 1",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Вытяжная система противодымной вентиляции — это ... (дать определение)",
    answers: {
      a: "проем или отверстие канала системы вытяжной противодымной вентиляции с установленной в нем сеткой, или решеткой, или дымовым люком, или нормально закрытым противопожарным клапаном",
      b: "автоматически и дистанционно управляемая вентиляционная система, предназначенная для удаления продуктов горения при пожаре через дымоприемное устройство или дымовой люк наружу здания",
      c: "нормально закрытый противопожарный клапан, имеющий предельное состояние по огнестойкости, характеризуемое только потерей плотности, и подлежащий установке непосредственно в проемах дымовых вытяжных шахт в защищаемых коридорах",
    },
    description:
      "СН 2.02.07-2020 Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П.3.3",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Выполнение работ и (или) оказание услуг по монтажу и наладке систем противодымной вентиляции должны осуществляться в соответствии с",
    answers: {
      a: "эксплуатационными документами на элементы этих систем пожарной автоматики",
      b: "разработанной, утвержденной и согласованной в установленном порядке проектной документацией, а также эксплуатационными документами на элементы этих систем пожарной автоматики с учетом требований ТНПА",
      c: "разработанной, утвержденной и согласованной в установленном порядке проектной документацией",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Пункт 26",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Дымовой клапан — это .. (дать определение)",
    answers: {
      a: "нормально закрытый противопожарный клапан с нормируемым пределом огнестойкости, устанавливаемый непосредственно в шахтах и воздуховодах систем противодымной вентиляции",
      b: "проем или отверстие канала системы вытяжной противодымной вентиляции с установленной в нем сеткой, или решеткой, или дымовым люком, или нормально закрытым противопожарным клапаном",
      c: "автоматически и дистанционно управляемое устройство, перекрывающее проемы в наружных ограждающих конструкциях помещений, защищаемых вытяжной противодымной вентиляцией с естественным побуждением тяги",
    },
    description:
      "СН 2.02.07-2020 Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 3.7",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "При отсутствии данных об объемном расходе воздуха в клапане дымоудаления нижнего жилого этажа для зданий постройки 1985 года и последующих лет следует принимать:",
    answers: {
      a: "10000 куб.м/ч",
      b: "5550 куб.м/ч",
      c: "7550 куб.м/ч",
    },
    description:
      "НПБ 23-2010 Противодымная защита зданий и сооружений. Методы приемо-сдаточных и периодических испьтаний. П.24",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "При выполнении работ по монтажу систем противодымной вентиляции лицензиат обязан:",
    answers: {
      a: "вести документацию, составляемую в ходе выполнения таких, предусмотренную ТНПА в области архитектурной, градостроительной и строительной деятельности",
      b: "вести документацию, составляемую по результатам выполнения таких работ, предусмотренную ТНПА в области архитектурной, градостроительной и строительной деятельности",
      c: "вести документацию, составляемую в ходе и по результатам выполнения таких работ, предусмотренную ТНПА в области архитектурной, градостроительной и строительной деятельности",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 29",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Противодымная защита зданий — это... (дать определение)",
    answers: {
      a: "комплекс технических средств, направленных на предотвращение воздействия на людей дыма, повышенной температуры и токсичных продуктов горения и обеспечение тушения пожара",
      b: "комплекс технических средств, направленных на предотвращение воздействия на людей дыма",
      c: "система объемно-планировочных, конструктивных решений зданий и инженерных устройств, предназначенных для предотвращения задымления защищенных эвакуационных путей и ограничения распространения продуктов горения при пожаре",
    },
    description:
      "СТБ 11.0.03-95* Система стандартов пожарной безопасности. Пассивная противопожарная защита. Термины и определения. П. 66",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Перечень оборудования, приборов (средств измерений) и инструментов, необходимых для выполнения работ и (или) оказания услуг по монтажу и наладке систем противодымной вентиляции установлен:",
    answers: {
      a: "постановлением МЧС от 14.12.2022 № 78",
      b: "постановлением МЧС от 14.12.2022 № 77",
      c: "постановлением МЧС от 09.12.2022 № 75",
    },
    description:
      "Постановление Министерства по чрезвычайным ситуациям от9 декабря 2023 г. № 75 О перечне оборудования, приборов (средств измерений) и инструментов",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Дымоприемное устройство — это .. (дать определение)",
    answers: {
      a: "проем или отверстие в воздуховоде или шахте системы вытяжной противодымной вентиляции с установленной в них сеткой (решеткой), или дымовым люком (дымовым клапаном), или фрамугой",
      b: "автоматически и дистанционно управляемое устройство, перекрывающее проемы в наружных ограждающих конструкциях помещений, защищаемых вытяжной противодымной вентиляцией с естественным побуждением тяги",
      c: "нормально закрытый противопожарный клапан, имеющий предельное состояние по огнестойкости, характеризуемое только потерей плотности, и подлежащий установке непосредственно в проемах дымовых вытяжных шахт в защищаемых коридорах",
    },
    description:
      "СН 2.02.07-2020 «Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 3.4",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Для систем приточной противодымой вентиляции приемные отверстия наружного воздуха следует размещать от выбросов продуктов горения систем противодымной вытяжной вентиляции на расстоянии",
    answers: {
      a: "не нормируется",
      b: "не менее 3 м",
      c: "не менее 5 м",
    },
    description:
      "СН 2.02.07-2020 Противодымная защита зданий и сооружений при пожаре. Системы вентиляции. П. 7.5",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "На какой высоте должны располагаться пусковые элементы устройств местного пуска газовых установок пожаротушения?",
    answers: {
      a: "1.6 м от уровня земли или пола",
      b: "1.4 +- 0.2 м от уровня земли или пола",
      c: "1.5 м от уровня земли или пола",
    },
    description: "п.9.10.4 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Какое максимальное количество спринклерных оросителей следует принимать в одной секции спринклерных УП при использовании сигнализаторов потока жидкости или оросителей с контролем состояния?",
    answers: {
      a: "1200",
      b: "500",
      c: "800",
    },
    description: "п.6.10.4 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Элементы систем ПА, применяемых при монтаже УПА должны соответствовать?",
    answers: {
      a: "эксплуатационным документам",
      b: "спецификациям проекта",
      c: "требованиям ТНПА",
    },
    description: "Приложение 1, пункт27 Постановление СОВМин РБ №234",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Что такое дистанционный пуск?",
    answers: {
      a: "включение под воздействием человека на пусковые элементы, размещаемые в защищаемом помещении или рядом с ним, в диспетчерской или на пожарном посту",
      b: "процесс, выполняемых техническими средствами по ранее заданному алгоритму после механического (ручного) воздействия человека на пусковые элементы, размещаемые в защищаемом помещении или рядом с ним, в диспетчерской или на пожарном посту, у защищаемого сооружения или оборудования",
      c: "процесс выполняемый по ранее заданному алгоритму после механического (ручного) воздействия человека на пусковые элементы",
    },
    description: "п.3.14 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Допускается ли трубопроводы УП крепить к конструкциям технических устройств?",
    answers: {
      a: "Нет, трубопроводы необходимо крепит только держателями непосредственно к конструкциям здания",
      b: "Да, только в порядке исключения и если нагрузку на конструкции технологических устройств принимают не менее чем двойная расчетная нагрузка для элементов крепления",
      c: "Да, только в порядке исключения, если не допускается использование трубопроводов в качестве опор ля других конструкций",
    },
    description: "п.6.13.2 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Зазор между стеной и трубопроводом газовой УП должен составлять... (закончить утверждение)",
    answers: {
      a: "Не менее 30 мм",
      b: "Не менее 20 мм",
      c: "Не менее 50 мм",
    },
    description: "п.9.7.4 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Допускается ли местный пуск аэрозольных УП?",
    answers: {
      a: "Допускается для одиночных ГОА",
      b: "Допускается",
      c: "Не допускается",
    },
    description: "п.11.5 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Аэрозольные установки пожаротушения должны обеспечивать задержку выпуска огнетушащего аэрозоля в защищаемое помещение на время, необходимое для эвакуации людей после подача звукового и светового сигналов оповещения о пуске генераторов, но... (закончить утверждение)?",
    answers: {
      a: "Не менее 30с",
      b: "Не менее 60с",
      c: "Не менее 180с",
    },
    description: "п.11.12 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "это...",
    answers: {
      a: "Контрольно-пусковой узел дренчерной УП",
      b: "Контрольно-пусковой узел заполненной спринклерной УП",
      c: "Клапан с электропуском",
    },
    image: "images/to-aspt-6.png",
    description: "Табл. 1 п.19 РД 25.953-90",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "С каким шагом устанавливаются узлы крепления трубопроводов с внутренним диаметром более 50 мм при монтаже установок пожаротушения?",
    answers: {
      a: "До 6 м",
      b: "До 2 м",
      c: "До 4 м",
    },
    description: "п.6.13.3 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Как обозначается в проекте трубопровод системы газового пожаротушения?",
    answers: {
      a: "П21",
      b: "В21",
      c: "П22",
    },
    description: "Табл. 2 п.4 РД 25.953-90",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Трубопровод подводящий – это... (дать определение)?",
    answers: {
      a: "Трубопровод, соединяющий источник огнетушащего вещества с узлами управления",
      b: "Трубопровод с установленными на нем оросителями (насадками) для распределения огнетушащего вещества в защищаемой зоне",
      c: "Трубопровод, соединяющий узел управления с распределительными трубопроводами",
    },
    description: "п.3.85 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Время с момента срабатывания спринкерного оросителя, установленного на воздушном трубопроводе, до начала подачи воды из него не должно превышать... (закончить утверждение)?",
    answers: {
      a: "160 с",
      b: "180 с",
      c: "120 с",
    },
    description: "п.6.10.6 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Минимальное расстояние от розетки спринклерного или дренчерного оросителя до плоскости перекрытия (покрытия) или сплошного потолка?",
    answers: {
      a: "0.4 м",
      b: "0.25 м",
      c: "0.08 м",
    },
    description: "п.6.6 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Каково максимальное расстояние от теплового замка побудительных устройств УП и спринклерных оросителей до плоскости перекрытия (покрытия) или потолка, имеющего сплошную конструкцию?",
    answers: {
      a: "0.5 м",
      b: "0.4 м",
      c: "0.1 м",
    },
    description: "п.6.6 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "С какими помещениями должно быть обеспечено телефонной связью помещение узла управления?",
    answers: {
      a: "С пожарным постом",
      b: "Все перечисленные",
      c: "Со станцией пожаротушения",
    },
    description: "п.6.14.4 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "При какой максимальной длине стояка (отвода) на распределительном трубопроводе дополнительные держатели не требуются?",
    answers: {
      a: "До 1.2 м",
      b: "До 1 м",
      c: "До 0.9 м",
    },
    description: "п.6.13.5 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Куда выводится сигнал от датчиков контроля положения запорной арматуры и задвижек, влияющих на подачу ОТВ от основного водопитателя (распылителя) применяемых в УП?",
    answers: {
      a: "На пульт централизованного наблюдения МЧС",
      b: "На ЦОУ Г(Р)ОЧС",
      c: "На пожарный прибор управления",
    },
    description: "п.6.4 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Каждое средство обеспечения пожарной безопасности и пожаротушения, подлежащее обязательной оценке соответствия, перед установкой (применением) в составе УПА должно:",
    answers: {
      a: "Пройти входной контроль",
      b: "Пройти идентификацию",
      c: "Пройти входной контроль и идентификацию",
    },
    description: "Приложение 1, пункт 4 Постановление СОВМин РБ №234",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Допускается ли в составе аэрозольных УП использовать генераторы с комбинированным пуском?",
    answers: {
      a: "Допускается в любом случае",
      b: "Запрещается",
      c: "Допускается для одиночных ГОА",
    },
    description: "п.11.6 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Что в проектной документации на УПА обозначается «В21»?",
    answers: {
      a: "Трубопровод системы водяного пожаротушения",
      b: "Трубопровод системы газового пожаротушения",
      c: "Трубопровод системы пенного пожаротушения",
    },
    description: "Табл. 2 п.1 РД 25.953-90",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Перечень оборудования, приборов (средств измерений) и инструментов, необходимых для выполнения работ (или) оказания услуг по монтажу и наладке УПА установлен:",
    answers: {
      a: "Постановлением МЧС от 14.12.2022 №77",
      b: "Постановлением МЧС от 09.12.2022 №75",
      c: "Постановлением МЧС от 14.12.2022 №78",
    },
    description: "Постановлением МЧС от 09.12.2022 №75",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Каково минимальное расстояние от сосудов с ОТВ централизованных газовых УП до источников тепла (приборов отопления)?",
    answers: {
      a: "0.5 м",
      b: "1.5 м",
      c: "1 м",
    },
    description: "п.9.6.3 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В каком случае растровые потолки с открытыми ячейками (типа грильято) могут размещаться ниже уровня расположения спринклеров без проведения натуральных испытаний?",
    answers: {
      a: "Высота установки оросителя не менее 3 м и расстояние от оросителя до растрового потолка не менее 1 м",
      b: "Все перечисленные",
      c: "Размер ячейки (отверстия) не менее 10х10 см и высота ламели растрового потолка не более 10 см",
    },
    description: "п.6.10.19 СН 2.02.03-20190",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Как следует устанавливать спринклерные оросители в заполненных установках?",
    answers: {
      a: "Розетками вверх, вниз и/или горизонтально",
      b: "Розетками вверх и/или горизонтально",
      c: "Розетками вниз и/или горизонтально",
    },
    description: "п.6.10.7 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Какое максимальное расстояние от держателя до последнего оросителя на распределительном трубопроводе для труб диаметром условного прохода свыше 0.025 м?",
    answers: {
      a: "1.2 м",
      b: "0.9 м",
      c: "1 м",
    },
    description: "п.6.13.6 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Какой температуре срабатывания спринклерного оросителя соответствует зеленый цвет жидкости в колбе?",
    answers: {
      a: "57 °С",
      b: "93 °С",
      c: "68 °С",
    },
    description: "п.5.1.1.6 СТБ 11.16.06-2011/ГОСТ Р 51043-2002",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "это...",
    answers: {
      a: "Ороситель пенный дренчерный розеточный",
      b: "Ороситель водяной спринклерный с вогнутой розеткой ",
      c: "Ороситель эвольвентный",
    },
    image: "images/to-aspt-5.png",
    description: "Табл. 1 п.6 РД 25.953-90",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Что в проектной документации на УПА обозначается «П21»?",
    answers: {
      a: "Трубопровод для подачи сжатого воздуха",
      b: "Трубопровод системы водяного пожаротушения",
      c: "Трубопровод системы газового пожаротушения",
    },
    description: "Табл. 2 п.4 РД 25.953-90",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "это...",
    answers: {
      a: "ороситель пенный дренчерный розеточный ",
      b: "ороситель водяной дренчерный с плоской розеткой",
      c: "ороситель водяной спринклерный с вогнутой розеткой",
    },
    image: "images/to-aspt-2.png",
    description: "Табл. 1 п.2 РД 25.953-90",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Для каких установок пожаротушения местный пуск не допускается?",
    answers: {
      a: "Для аэрозольных УП",
      b: "Для газовых УП",
      c: "Для порошковых УП",
    },
    description: "п.11.5 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Какова инерционность (время срабатывания без учета времени задержки впуска ОТВ) газовой УП?",
    answers: {
      a: "Не более 60 с",
      b: "Не более 15 с",
      c: "Не более 180 с",
    },
    description: "п.9.5.1 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Какое максимальное количество спринклерных оросителей следует принимать для одной секции во внутристеллажном пространстве?",
    answers: {
      a: "1200",
      b: "500",
      c: "800",
    },
    description: "п.6.10.4 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Какой температуре срабатывания спринклерного оросителя соответствует красный цвет жидкости в колбе?",
    answers: {
      a: "68 °С",
      b: "93 °С",
      c: "57 °С",
    },
    description: "п.5.1.1.6 СТБ 11.16.06-2011/ГОСТ Р 51043-2002",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "это...",
    answers: {
      a: "Ороситель пенный дренчерный розеточный",
      b: "Ороситель водяной дренчерный с плоской розеткой",
      c: "Ороситель пенный спринклерный розеточный",
    },
    image: "images/to-aspt-3.png",
    description: "Табл. 1 п.5 РД 25.953-90",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Какие способы соединения трубопроводов допускается в установках пожаротушения водой?",
    answers: {
      a: "Сварной, фланцевый, резьбовые соединения, а также разъемными трубопроводными муфтами (диаметром не более 200 мм.)",
      b: "Сварной, фланцевый, резьбовой",
      c: "Сварной, резьбовой, муфтовый (диаметром не более 100 мм.)",
    },
    description: "п.6.12.1 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Модульная газовая УП должна обеспечивать подачу не менее 95% массы ОТВ (сжиженные газы кроме двуокиси углерода), требуемой для создания нормальной огнетушащей концентрации в защищаемом помещении, за временной интервал, не превышающий, ...(закончить предложение)",
    answers: {
      a: "10 с",
      b: "30 с",
      c: "15 с",
    },
    description: "п.9.5.2 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Какой температуре срабатывания спринклерного оросителя соответствует оранжевый цвет жидкости в колбе?",
    answers: {
      a: "68 °С",
      b: "57 °С",
      c: "93 °С",
    },
    description: "п.5.1.1.6 СТБ 11.16.06-2011/ГОСТ Р 51043-2002",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Что в проектной документации на УПА обозначается «П22»?",
    answers: {
      a: "Трубопровод для подачи сжатого воздуха",
      b: "Трубопровод системы водяного пожаротушения",
      c: "Трубопровод системы газового пожаротушения",
    },
    description: "Табл. 2 п. 5 РД 25.953-90",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "В какой цвет окрашиваются клапаны УП?",
    answers: {
      a: "Зеленый",
      b: "Красный",
      c: "Черный",
    },
    description: "п.5 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "При выполнении работ и (или) оказания услуг по монтажу УПА лицензиат обязан:",
    answers: {
      a: "Вести документацию, составляемую по результатам выполнения таких работ и (или) оказания услуг, предусмотренную ТНПА в области архитектурной, градостроительной и строительной деятельности",
      b: "Вести документацию, составляемую в ходе выполнения таких работ и (или) оказания услуг, предусмотренную ТНПА в области архитектурной, градостроительной и строительной деятельности",
      c: "Вести документацию, составляемую в ходе и по результатам выполнения таких работ и (или) оказания услуг, предусмотренную ТНПА в области архитектурной, градостроительной и строительной деятельности",
    },
    description: "Приложение 1, пункт 29 Постановление СОВМин РБ №234",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "это...",
    answers: {
      a: "Клапан с электропуском",
      b: "Контрольно-пусковой узел заполненной спринклерной УП",
      c: "Контрольно-пусковой узел дренчерной УП",
    },
    image: "images/to-aspt-7.png",
    description: "Табл. 1 п.25 РД 25.953-90",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Какой резерв по огнетушащему веществу должны иметь газовые установки пожаротушения?",
    answers: {
      a: "100%",
      b: "Резерв ОТВ предусматривается при соответствующем решении заказчика",
      c: "Резерв ОТВ не предусматривается",
    },
    description: "п.9.4.4 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Максимальное количество спринклерных оросителей в одной секции спринклерной установки в общем случае?",
    answers: {
      a: "1200",
      b: "800",
      c: "500",
    },
    description: "п.6.10.4 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Каков минимальный объем промежуточной мембранной емкости подпитывающего насоса (жокей-насоса) в УП?",
    answers: {
      a: "100 л",
      b: "40 л",
      c: "80 л",
    },
    description: "п.6.15.9 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Какие требования предъявляются к электрооборудованию (исключая электрооборудование аварийного освещения, систем оповещения о пожаре и управления эвакуацией, противодымной вентиляции) расположенному в помещениях, защищаемых водяными и пенными УП?",
    answers: {
      a: "Должно иметь степень защиты оболочки от проникновения воды не ниже 5 по ГОСТ 14254, либо следует предусматривать автоматическое отключение электроэнергии для питания указанного электрооборудования до момента подачи ОТВ на очаг пожара",
      b: "Должно иметь степень защиты оболочки от проникновения воды не ниже 4 по ГОСТ 14254, либо такие электроустановки должны быть оборудованы устройствами защитного отключения",
      c: "Должно иметь степень защиты оболочки от проникновения воды не ниже 4 по ГОСТ 14254, либо следует предусматривать автоматическое отключение электроэнергии для питания указанного электрооборудования до момента подачи ОТВ на очаг пожара, либо такие электроустановки должны быть оборудованы устройствами защитного отключения",
    },
    description: "п.6.2 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Каково максимальное время закрытия воздушных затворов (противопожарных клапанов) в воздуховодах до подачи ОТВ в защищаемую зону при устройстве аэрозольных установок пожаротушения?",
    answers: {
      a: "Не более 30 с",
      b: "Не более 60 с",
      c: "Не более 15 с",
    },
    description: "п.11.13.5 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Каково максимальное расстояние от держателя до последнего оросителя на распределительном трубопроводе для труб диаметром условного прохода до 0.025 м?",
    answers: {
      a: "1.2 м",
      b: "1 м",
      c: "0.9 м",
    },
    description: "п.6.13.6 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Какой способ соединения трубопроводов допускается в установках пожаротушения водой при прокладке их за несъемными подвесными потолками, в закрытых штробах и в других случаях отсутствия к ним доступа?",
    answers: {
      a: "Только резьбовой",
      b: "Только сварной",
      c: "Только муфтовый (для труб диаметром не более 200 мм.)",
    },
    description: "п.6.12.2 СН2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Как обозначается в проекте трубопровод системы пенного пожаротушения?",
    answers: {
      a: "П21",
      b: "П22",
      c: "В22",
    },
    description: "Табл. 2 п.2 РД 25.953-90",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "это...",
    answers: {
      a: "Ороситель пенный спринклерный розеточный ",
      b: "Ороситель водяной дренчерный с плоской розеткой",
      c: "Ороситель водяной спринклерный с вогнутой розеткой",
    },
    image: "images/to-aspt-1.png",
    description: "Табл. 1 п.1 РД 25.953-90",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Установка пожаротушения автоматическая – это...",
    answers: {
      a: "Установка пожаротушения автоматическая, функционируящая независимо от внешних источников питания и обеспечивающая передачу сигнала о пожаре во внешние цепи",
      b: "Установка пожаротушения автоматическая, оснащенная техническими средствами обнаружения очага возгорания и управления выпуском огнетушащего вещества в зону пожара",
      c: "Установка пожаротушения, обеспечивающая подачу (выпуск) огнетушащего вещества при поступлении управляющего сигнала от системы пожарной сигнализации либо собственных технических средств обнаружения возгорания без участия человека, а также передачу сигнала о пожаре во внешние цепи",
    },
    description: "п.6. ТР ЕАЭС 043/2017",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Выполнение работ и (или) оказание услуг по монтажу и наладке УПА должны осуществляться в соответствии с:",
    answers: {
      a: "Разработанной, утвержденной и согласованной в установленном порядке проектной документацией",
      b: "Эксплуатационными документами на элементы этих систем пожарной автоматики",
      c: "Разработанной, утвержденной и согласованной в установленном порядке проектной документацией, а также эксплуатационными документами на элементы этих систем пожарной автоматики с учетом требований ТНПА",
    },
    description: "Приложение 1, пункт 26 Постановление СОВМин РБ №234",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Допускается ли применение в водяных УП трубопроводов из горючих материалов?",
    answers: {
      a: "Допускается для УП тонкораспыленной водой",
      b: "Допускается в соответствии с их областью применения после проведения соответствующих испытаний",
      c: "Не допускается",
    },
    description: "п.6.12.1 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "это...",
    answers: {
      a: "Ороситель пенный спринклерный розеточный",
      b: "Ороситель водяной дренчерный с плоской розеткой",
      c: "Ороситель пенный дренчерный розеточный",
    },
    image: "images/to-aspt-4.png",
    description: "Табл. 1 п.4 РД 25.953-90",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "После завершения наладки систем ПА в целом, лицензиатом, выполнившим их монтаж, должен быть оформлен:",
    answers: {
      a: "Паспорт системы пожарной автоматики",
      b: "Акт первичного обследования системы пожарной автоматики",
      c: "Акт проведения комплексного опробывания системы пожарной автоматики",
    },
    description: "Приложение 1, пункт 31 Постановление СОВМин РБ №234",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Как должен осуществляться запуск системы противодымной вентиляции в помещениях, оборудованных спринклерными УП?",
    answers: {
      a: "От СПС (без тепловых ПИ)",
      b: "От спринклерной УП",
      c: "От СПС (без дымовых ПИ)",
    },
    description: "п.5.10 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Что в проектной документации на УПА обозначается В22",
    answers: {
      a: "Трубопровод системы газового пожаротушения",
      b: "Трубопроводы системы пенного пожаротушения",
      c: "Трубопровод для подачи сжатого воздуха",
    },
    description: "Табл. 2 п.2 РД 25.953-90",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Каково расстояние от отражателя спринклерного оросителя, устанавливаемого горизонтально относительно своей оси, до плоскости перекрытия (покрытия) или потолка, имеющего сплошную конструкцию?",
    answers: {
      a: "До 0.07 м",
      b: "От 0.07 до 0.15 м",
      c: "От 0.1 до 0.25 м",
    },
    description: "п.6.6 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Кто осуществляет входной контроль средств обеспечения пожарной безопасности и пожаротушения:",
    answers: {
      a: "Производитель работ",
      b: "Начальник участка",
      c: "Ответственное лицо (лица) из числа технических руководителей, назначенное (ые) приказом руководителя лицензиата",
    },
    description: "Приложение 1, пункт 4 Постановление СОВМин РБ №234",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Инерционность УП пенной высокой кратности не должна превышать...",
    answers: {
      a: "120 с",
      b: "60 с",
      c: "180 с",
    },
    description: "п.7.4 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "С каким уклоном в сторону узла управления или спускных устройств прокладываются питающие и распределительные трубопроводы дренчерных и воздушных спринклерных УП для труб с наружным диаметром 57 мм и более?",
    answers: {
      a: "0.010",
      b: "0.005",
      c: "0.001",
    },
    description: "п.6.12.12 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Допускается ли устанавливать пробковые краны в верхних точках сети трубопроводов спринклерных УП?",
    answers: {
      a: "В качестве промывочных кранов с диаметром условного прохода не менее 25 мм",
      b: "Да, в качестве устройств для выпуска воздуха",
      c: "Не допускается",
    },
    description: "п.6.12.11 СН 2.020.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Централизованная газовая УП должна обеспечить подачу не менее 95% массы ОТВ (сжиженные газы кроме двуокиси углерода), требуемой для создания нормативной огнетушащей концентрации в защищаемом помещении, за временной интервал, не превышающий... (закончить утверждение)",
    answers: {
      a: "15 с",
      b: "10 с",
      c: "30 с",
    },
    description: "п.5.5.2 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Какая степень защиты оболочки от проникновения по ГОСТ 14254 должна быть предусмотрена у электрооборудования аварийного освещения о пожаре и управления эвакуацией, противодымной вентиляции размещенного в помещениях, защищаемых водяным и пенным УП?",
    answers: {
      a: "Не ниже IPх6 – защита от сильного действия струи",
      b: "Не ниже IPх4 – сплошное обрызгивание",
      c: "Не ниже IPх3 – дождевание",
    },
    description: "п.6.2 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Трубопровод питающий – это... (дать определение)",
    answers: {
      a: "Трубопровод, соединяющий распределительные устройства с распределительными трубопроводами",
      b: "Трубопровод, соединяющий узел управления с распределительными трубопроводами",
      c: "Трубопровод с установленными на нем оросителями (насадками) для распределения огнетушащего вещества в защищаемой зоне",
    },
    description: "п.3.77 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Как должен реализовываться запуск пожарного насоса",
    answers: {
      a: "По схеме или от одного из двух сигнализаторов давления, или одного из двух электроконтактных манометров",
      b: "По схеме или от двух электроконтактных манометров, одного сигнализатора давления или одного адресного ПИ",
      c: "По схеме или от двух электроконтактных манометров, двух сигнализаторов давления или одного адресного ПИ",
    },
    description: "п.6.16.9 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Какой запас огнетушащего вещества должны иметь газовые установки пожаротушения?",
    answers: {
      a: "50%",
      b: "100%",
      c: "Запас ОТВ предусматривается при соответствующем решении заказчика",
    },
    description: "п.9.4.4 СН 2.02.03.2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "С каким шагом устанавливаются узлы крепления трубопроводов с внутренним диаметром менее 50 мм при монтаже установок пожаротушения?",
    answers: {
      a: "Не более 4 м",
      b: "Не более 6 м",
      c: "Не более 3 м",
    },
    description: "п.6.13.3 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Трубопровод магистральный – это... (дать определение)",
    answers: {
      a: "Трубопровод, соединяющий пожарные насосы с узлами управления",
      b: "Трубопровод, соединяющий узел управления с распределительными трубопроводами",
      c: "Трубопровод, соединяющий распределительные устройства с распределительными трубопроводами",
    },
    description: "п.3.83 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "С каким уклоном в сторону узла управления или спускных устройств прокладываются питающие и распределительные трубопроводы дренчерных и воздушных спринклерных УП для труб с наружным диаметром менее 57 мм?",
    answers: {
      a: "0.001",
      b: "0.005",
      c: "0.010",
    },
    description: "п.6.12.12 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Как обозначается оборудование и трубопроводы пожарной автоматики в зданиях любого функционального назначения?",
    answers: {
      a: "Окрашены (обозначены) в соответствующий цвет",
      b: "Все перечисленное",
      c: "Знаками пожарной безопасности",
    },
    description: "п.5.15 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Трубопровод распределительный – это... (дать определение)",
    answers: {
      a: "Трубопровод, соединяющий пожарные насосы с узлами управления",
      b: "Трубопровод, соединяющий распределительные устройства с распределительными трубопроводами",
      c: "Трубопровод с установленными на нем оросителями (насадками) для распределения огнетушащего вещества в защищаемой зоне",
    },
    description: "п.3.86 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Каким должен быть резерв емкости приемно-контрольного оборудования?",
    answers: {
      a: "не менее 10% при числе шлейфов более 10",
      b: "не менее 25% при числе шлейфов более 15",
      c: "не менее 15% при числе шлейфов более 5",
    },
    description: "п. 12.11.2 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Как следует устанавливать дымовые и тепловые ПИ в отсеках потолка шириной 0,75 м и более, ограниченных строительными конструкциями выступающими от потолка на расстояние более 0.4 м?",
    answers: {
      a: "в каждом отсеке потолка",
      b: "нет верного ответа",
      c: "в каждом втором отсеке потолка",
    },
    description: "п. 12.3.14 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Допускается ли установка приборов пожарной автоматики на конструкциях выполненных из материалов групп горючести Г2-Г4?",
    answers: {
      a: "не допускается",
      b: "допускается в любом случае",
      c: "допускается при условии защиты этих конструкций металическим листом толщиной не менее 1 мм или другим листовым негорючим материалом толщиной не менее 10 мм",
    },
    description: "п. 13.5 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Каким должно быть расстояние между ручными пожарными извещателями внутри здания?",
    answers: {
      a: "не менее 60 м",
      b: "не менее 150 м",
      c: "не более 40 м",
    },
    description: "п. 12.10.2 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Каким должен быть радиус сплошной конструкции потолка вокруг ПИ, в помещениях, для которых предусматривается подача воздуха через перфорированный потолок?",
    answers: {
      a: "0.5 м",
      b: "0.7 м",
      c: "0.6 м",
    },
    description: "п. 12.3.12 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Дайте характеристику уровня доступа к функциям ППУ №2",
    answers: {
      a: "для персонала, ответственного за эксплуатацию ППУ",
      b: "для обслуживающего персонала",
      c: "для дежурного персонала и специалистов ответственных за контроль состояний ППУ",
    },
    description: "Приложение В СТБ 11.14.01-2006",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Элементы систем ПА, применяемые при монтаже СПС должны соответствовать:",
    answers: {
      a: "требованиям ТНПА",
      b: "спецификациям проекта",
      c: "эксплуатационным документам",
    },
    description:
      "Приложение 1, п. 27 Постановление Совета Министров РБ от 10.04.2023 №234",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "На каком максимальном расстоянии от перекрытия допускается подвеска извещателей на тросах?",
    answers: {
      a: "300 мм",
      b: "100 мм",
      c: "200 мм",
    },
    description: "п. 12.3.9 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Каково максимальное расстояние от потолка до нижней точки ПИ при подвеске ПИ на тросах?",
    answers: {
      a: "не более 200 мм",
      b: "не допускается подвеска ПИ на тросах",
      c: "не более 300 мм",
    },
    description: "п. 12.3.9 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "К каким ИП по определяемому опасному фактору пожара относится извещатель ИП-435?",
    answers: {
      a: "к комбинированным",
      b: "к дымовым",
      c: "к газовым",
    },
    description: "Приложение А, СТБ 2469-2016",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Что из нижеперечисленного подлежит обязательному заземлению (занулению)?",
    answers: {
      a: "металлические корпуса ППКП, ППУ и функциональных блоков, а также щиты, шкафы и конструкции, на которых они устанавливаются",
      b: "корпуса соединительных и протяжных коробок, если вводы выполнены стальными трубами с обеспечением надежного электрического контакта",
      c: "корпуса ППКП, ППУ и функциональных блоков, устанавливаемых на заземленных щитах, шкафах и конструкциях, если между ними обеспечен надежный электрический контакт",
    },
    description: "п. 18.2 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Каков физический принцип действия извещателя ИП-131?",
    answers: {
      a: "термобарометрический",
      b: "с использованием эффекта памяти формы",
      c: "радиоизотопный",
    },
    description: "Приложение А, СТБ 2218-2011",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Каждое средство обеспечения пожарной безопасности и пожаротушения, подлежащее обязательной оценке соответствия, перед установкой (применением) в составе СПС должно:",
    answers: {
      a: "пройти идентификацию",
      b: "пройти входной контроль и идентификацию",
      c: "пройти входной контроль",
    },
    description:
      "Приложение 1, п. 4 Постановление Совета Министров РБ от 10.04.2023 №234",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Каков физический принцип действия извещателя ИП109?",
    answers: {
      a: "с использованием плавких вставок (сплав Вуда)",
      b: "с использованием зависимости магнитной индукции от температур",
      c: "с использованием зависимости модуля упругости от температуры",
    },
    description: "Приложение А, СТБ 2218-2011",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "При каком условии допускается включать в адресный (кольцевой) шлейф АППКП 128 ПИ?",
    answers: {
      a: "нет верного ответа",
      b: "в соответствии с техническими возможностями приемно-контрольной аппаратуры",
      c: "в соответствии с техническими возможностями ПИ",
    },
    description: "п. 12.3.5 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Каков физический принцип действия извещателя ИП-101?",
    answers: {
      a: "с использованием ТЭДС",
      b: "с использованием линейного расширения элемента",
      c: "с использованием зависимости электрического сопротивления проводника от температуры окружающей среды",
    },
    description: "Приложение А, СТБ 2218-2011",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Минимальное освещение в местах установки РПИ составляет... (закончить утверждение)",
    answers: {
      a: "20 лк",
      b: "10 лк",
      c: "15 лк",
    },
    description: "п. 12.10.3 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Что обозначает первая цифра маркировки пожарного извещателя (ИП-000)?",
    answers: {
      a: "контролируемый признак пожара",
      b: "физический принцип действия",
      c: "технический номер разработки",
    },
    description: "Приложение А, СТБ 2218-2011",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "На какой высоте устанавливаются функциональные блоки системы пожарной сигнализации и ППУ на корпусах которых отсутствуют органы управления, предохранители и регулировочные элементы, с помощью которых осуществляется управление и отключение при их размещении в специально выделенном помещении?",
    answers: {
      a: "не менее 1.5 м",
      b: "не менее 0.8 м",
      c: "не менее 2.2 м",
    },
    description: "п. 13.4 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "К каким ИП по определяемому опасному фактору пожара относится извещатель ИП-435?",
    answers: {
      a: "к комбинированным",
      b: "к газовым",
      c: "к дымовым",
    },
    description: "Приложение А, СТБ 2218-2011",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Каким должно быть расстояние между приборами пожарной автоматики и потолком из сгораемых материалов?",
    answers: {
      a: "не нормируется",
      b: "не менее 0.8 м",
      c: "не менее 1 м",
    },
    description: "п. 13.3 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Дайте характеристику уровню доступа к функциям ППУ №4",
    answers: {
      a: "для персонала, ответственного за эксплуатацию ППУ",
      b: "для обслуживающего персонала",
      c: "для производителей ППУ и его представителей",
    },
    description: "Приложение В, СТБ 11.14.01-2006",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "-это",
    answers: {
      a: "ручной ИП",
      b: "тепловой ИП",
      c: "дымовой ИП",
    },
    image: "images/min-sps-4.png",
    description: "Табл. 3 п. 4, РД 25.953-90",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "На каком расстоянии от потолка должна производится прокладка шлейфов по стенам внутри здания?",
    answers: {
      a: "не менее 0,2 м от потолка и, как правило, на высоте не менее 2,1 м от пола",
      b: "не менее 0,05 м от потолка и, как правило, на высоте не менее 2,5 м от пола",
      c: "не менее 0,1 м от потолка и, как правило, на высоте не менее 2,2 м от пола",
    },
    description: "п. 16.13 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Каков физический принцип действия извещателя ИП-211?",
    answers: {
      a: "термобарометрический",
      b: "радиоизотопный",
      c: "с использованием эффекта памяти формы",
    },
    description: "Приложение А, СТБ 2218-2011",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Выполнение работ и (или) оказание услуг по монтажу и наладке СПС должны осуществляться в соответствии с:",
    answers: {
      a: "разработанной, утвержденной и согласованной в установленном порядке проектной документацией, а также эксплуатационными документами на элементы этих систем пожарной автоматики с учетом требований ТНПА",
      b: "эксплуатационными документами на элементы этих систем пожарной автоматики",
      c: "с разработанной, утвержденной и согласованной в установленном порядке проектной документацией",
    },
    description:
      "Приложение 1 п.26 Постановление Совета Министров РБ от 10.04.2023 №234",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Какое количество ПИ следует предусмотреть в радиальные шлейфы?",
    answers: {
      a: "32 ПИ или 10 РПИ",
      b: "64 ПИ или 10 РПИ",
      c: "32 ПИ или 20 РПИ",
    },
    description: "п. 12.3.5 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Какое количество ПИ и РПИ (суммарно) следует предусматривать в кольцевое шлейфы?",
    answers: {
      a: "не более 10",
      b: "не более 32",
      c: "не более 128",
    },
    description: "п. 12.3.5 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "При какой ширине коридора допускается увеличивать расстояние между дымовыми извещателями?",
    answers: {
      a: "менее 3 м",
      b: "менее 4 м",
      c: "менее 2 м",
    },
    description: "п. 12.3.18 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "На каком расстоянии от стен следует размещать точечные ПИ при установке под перекрытием или подвесным потолком, имеющим сплошную конструкцию?",
    answers: {
      a: "не менее 0.2 м",
      b: "не менее 0.3 м",
      c: "не менее 0.1 м",
    },
    description: "п. 12.3.8 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "На каком минимальном расстоянии от углов стен допускается устанавливать пожарные извещатели?",
    answers: {
      a: "0.3 м",
      b: "0.2 м",
      c: "0.1 м",
    },
    description: "п. 12.3.8 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В течении какого времени должен обеспечить бесперебойную работу СПС резервный источник питания?",
    answers: {
      a: "в дежурном режиме в течение 12 ч и в режиме «Тревога» - не менее 2 ч",
      b: "в дежурном режиме в течение 24 ч и в режиме «Тревога» - не менее 1 ч",
      c: "в дежурном режиме в течение 24 ч и в режиме «Тревога» - не менее 3 ч",
    },
    description: "п. 12.3.8 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В каких случаях допускается применение во взрывопожароопасных зонах ПИ не во взрывозащищенном исполнении?",
    answers: {
      a: "ПИ включены в искробезопасные шлейфы ППКП",
      b: "ПИ включены в искробезопасные шлейфы ППКП, ПИ не имеют собственного источника тока и не обладают индуктивностью или емкостью",
      c: "не допускается ",
    },
    description: "п. 12.1.6 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "это",
    answers: {
      a: "ИП пламени",
      b: "тепловой ИП",
      c: "дымовой ИП",
    },
    image: "images/min-sps-1.png",
    description: "Табл. 3 п. 1, РД 25.953-90",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "На каком расстоянии от угла стен следует размещать ПИ на стенах?",
    answers: {
      a: "не менее 0.2 м",
      b: "не менее 0.1 м",
      c: "не менее 0.3 м",
    },
    description: "п. 12.3.9 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "это...",
    answers: {
      a: "тепловой ИП ",
      b: "ИП пламени",
      c: "дымовой ИП",
    },
    image: "images/min-sps-3.png",
    description: "Табл. 3 п. 3, РД 25.953-90",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Каков физический принцип действия извещателя ИП-105?",
    answers: {
      a: "с использованием зависимости модуля упругости от температуры",
      b: "с использованием зависимости магнитной индукции от температуры",
      c: "с использованием плавких или сгораемых вставок",
    },
    description: "Приложение А, СТБ 2218-2011",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Перечень оборудования, приборов (средств измерений) и инструментов, необходимых для выполнения работ и (или) оказания услуг по монтажу и наладке СПС установлен:",
    answers: {
      a: "постановлением МЧС от 14.12.2022 № 78",
      b: "постановлением МЧС от 14.12.2022 № 77",
      c: "постановлением МЧС от 09.12.2022 № 75",
    },
    description: "Постановление МЧС  09.12.2022 № 75",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Дайте характеристику уровню доступа к функциям ППУ №3",
    answers: {
      a: "для дежурного персонала и специалистов ответственных за контроль состояний ППУ",
      b: "для персонала, ответственного за эксплуатацию ППУ",
      c: "для технического обслуживающего персонала, осуществляющего конфигурирование ППУ",
    },
    description: "Приложение В, СТБ 11.14.01-2006",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Могут ли включать в шлейф СПС извещатели различного типа?",
    answers: {
      a: "допускается для неадресных систем",
      b: "допускается для адресных систем",
      c: "не допускается для адресных систем",
    },
    description: "п. 12.3.4 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Каково минимальное расстояние от оптической оси линейного дымового ПИ до стены либо окружающих предметов?",
    answers: {
      a: "0.9 м",
      b: "0.2 м",
      c: "0.5 м",
    },
    description: "п. 12.5.1 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "При выполнении работ по монтажу СПС лицензиат обязан:",
    answers: {
      a: "вести документацию, составляемую в ходе и по результатам выполнения таких работ, предусмотренную ТНПА в области архитектурной, градостроительной и строительной деятельности",
      b: "вести документацию, составляемую по результатам выполнения таких работ, предусмотренную ТНПА в области архитектурной, градостроительной и строительной деятельности",
      c: "вести документацию, составляемую в ходе выполнения таких, предусмотренную ТНПА в области архитектурной, градостроительной и строительной деятельности",
    },
    description:
      "Приложение 1 п.29 Постановление Совета Министров РБ от 10.04.2023 №234",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Каково минимальное расстояние между приборами пожарной автоматики при их горизонтальном размещении?",
    answers: {
      a: "не нормируется",
      b: "60 мм",
      c: "40 мм",
    },
    description: "п. 13.3 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Каково минимальное расстояние от РПИ до различных предметов, мебели, оборудования?",
    answers: {
      a: "0.25 м",
      b: "0.75 м",
      c: "0.5 м",
    },
    description: "п. 12.10.2 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Какие режимы работы должны достоверно определяться ППКП?",
    answers: {
      a: "тревога, неисправность, контроль",
      b: "дежурный, пожар, неисправность, контроль",
      c: "дежурный, тревога, неисправность",
    },
    description: "п. 5.9 СТБ 11.16.01-98",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "На какой высоте от уровня пола устанавливается РПИ?",
    answers: {
      a: "1.6 +- 0.2 м",
      b: "1.2 +- 0.2 м",
      c: "1.4 +- 0.2 м",
    },
    description: "п. 12.10.5 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В помещениях какой высоты линейные дымовые ПИ следует устанавливать в два яруса?",
    answers: {
      a: "свыше 12 м",
      b: "свыше 9 м",
      c: "свыше 6 м",
    },
    description: "п. 12.5.5 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "это...",
    answers: {
      a: "дымовой ИП",
      b: "ИП пламени",
      c: "тепловой ИП",
    },
    image: "images/min-sps-2.png",
    description: "Табл. 3 п. 1 РД 25.953-90",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Как допускается осуществлять питание электроприемников СПС при отсутствии возможности устройства питания от двух независимых источников?",
    answers: {
      a: "питание от разных трансформаторов двухтрансформаторной подстанции или от двух близлежащих однотрансформаторых подстанций, подключенных к разным питающим линиям, проложенным по разным трассам, с устройством автоматического ввода резерва, как правило, на стороне низкого напряжения",
      b: "питание от разных трансформаторов однотрансформаторной подстанции или от двух близлежащих двухтрансформатоных подстанций, подключенных к одной питающей линии, с устройством автоматического ввода резерва, как правило, на стороне низкого напряжения",
      c: "правильного ответа нет",
    },
    description: "п. 17.2 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Какие условия должны выполняться при включении в одну зону контроля, более пяти защищаемых помещений?",
    answers: {
      a: "помещения в пределах зоны контроля должны иметь выход в общий коридор (холл, вестибюль и др.) или на открытую территорию",
      b: "на приборах, обеспечивающих индикацию состояний СПС, должно отображаться обозначение каждого контролируемого помещения или над входами в указанные помещения со стороны обещго помещения (коридора, холла, вестибюля, фойе) должна быть предусмотрена выносная световая сигнализация о срабатывании ПИ",
      c: "все перечисленные",
    },
    description: "п. 13.4 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "На какой высоте от уровня пола устанавливается объектовое оконечное устройство системы передачи извещений (СПИ) в специально выделенных помещениях?",
    answers: {
      a: "не менее 0.8 м",
      b: "не менее 2.2 м",
      c: "не менее 1.5 м",
    },
    description: "п. 13.4 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Что обозначает первая цифра маркировки пожарного извещателя (ИП-000)?",
    answers: {
      a: "физический принцип действия",
      b: "контролируемый признак пожара",
      c: "технически номер разработки",
    },
    description: "Приложение А, СТБ 2218-2011",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "При какой максимальной высоте помещения разрешается устанавливать тепловые пожарные извещатели?",
    answers: {
      a: "не более 7 м",
      b: "9 м",
      c: "5 м",
    },
    description: "п. 12.6.1 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "На каком расстоянии возможно размещать приборы пожарной автоматики от отопительных приборов?",
    answers: {
      a: "не менее 10 см",
      b: "не менее 1 см",
      c: "не менее 100 см",
    },
    description: "п. 13.6 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Допускается ли применять в адресной СПС неадресные ПИ?",
    answers: {
      a: "да, в обоснованных случаях, при включении в ПИ в адресные функциональные блоки",
      b: "нет правильного ответа",
      c: "да",
    },
    description: "п. 12.1.7 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "На какой высоте следует производить установку оповещателей на наружном фасаде здания?",
    answers: {
      a: "на высоте не менее 3 м от уровня пола",
      b: "на высоте не менее 2,5 м от уровня пола",
      c: "на высоте не менее 2 м от уровня пола",
    },
    description: "п. 13.7 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Каков физический принцип действия извещателя ИП-102?",
    answers: {
      a: "с  использованием линейного расширения элемента",
      b: "с использованием термо-ЭДС",
      c: "с использованием зависимости электрического сопротивления проводника от температуры окружающей среды",
    },
    description: "Приложение А, СТБ 2218-2011",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "На каком расстоянии от перекрытия должна проходить оптическая ось линейных дымовых извещателей?",
    answers: {
      a: "не более 1.8 м",
      b: "не более 0.6 м",
      c: "не более 0.7 м",
    },
    description: "п. 12.5.2 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "При расстановке ПИ необходимо учитывать... (закончить утверждение)",
    answers: {
      a: "оптическое расстояние от любой из точек данной защищаемой площади до ближайшего ПИ; наличие препятствий, влияющих на распространение излучения очага пожара",
      b: "оптическое расстояние от любой из точек данной защищаемой площади до ближайшего ПИ",
      c: "наличие препятствий, влияющих на распространение излучения очага пожара; наличие источников помех (осветительное оборудование, источники тепла и открытого пламени и др.)",
    },
    description: "п. 12.1.3 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Каков физический принцип действия извещателя ИП-103?",
    answers: {
      a: "с использованием зависимости электрического сопротивления проводника от температуры окружающей среды",
      b: "с использованием ТЭДС",
      c: "с использованием линейного расширения",
    },
    description: "Приложение А, СТБ 2218-2011",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "это...",
    answers: {
      a: "оконечное устройство",
      b: "тепловой ИП",
      c: "ручной ИП",
    },
    image: "images/min-sps-5.png",
    description: "Табл. 3 п.15 РД 29.953-90",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Дайте характеристику уровню доступа к функциям ППУ №1.",
    answers: {
      a: "для дежурного персонала и специалистов ответственных за контроль состояний ППУ",
      b: "для обслуживающего персонала",
      c: "для представителей производителя оборудования",
    },
    description: "Приложение В, СТБ 11.14.01-2006",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Система пожарной автоматики – это...",
    answers: {
      a: "совокупность взаимодействующих систем пожарной сигнализации, передачи извещений о пожаре, оповещения и управления эвакуацией людей, противодымной вентиляции, предназначенных для обеспечения пожарной безопасности объекта",
      b: "совокупность взаимодействующих систем пожарной сигнализации, передачи извещений о пожаре, оповещения и управления эвакуацией людей, противодымной вентиляции, установок автоматического пожаротушения и иного оборудования автоматической противопожарной защиты, предназначенных для обеспечения пожарной безопасности объекта",
      c: "совокупность взаимодействующих систем пожарной сигнализации, передачи извещений о пожаре, противодымной вентиляции, установок автоматического пожаротушения и иного оборудования автоматической противопожарной защиты, предназначенных для обеспечения пожарной безопасности объекта",
    },
    description: "Пункт 6 ТР ЕАЭС 043/2017",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Каков физический принцип действия извещателя ИП-114?",
    answers: {
      a: "с использование эффекта памяти формы",
      b: "радиоизотопный",
      c: "термобарометрический",
    },
    description: "Приложение А, СТБ 2218-2011",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "На какое расстояние должен выступать за контуры приборов пожарной автоматики металлический лист при установке приборов пожарной автоматики на конструкциях из сгораемых материалов?",
    answers: {
      a: "не менее чем на 100 мм",
      b: "не менее чем на 150 мм",
      c: "не менее чем на 50 мм",
    },
    description: "п. 13.5 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "В каком случае допускается предусматривать формирование команды на управление оповещением о пожаре от одного ПИ?",
    answers: {
      a: "если это не нарушает функционирование объекта в случае ложного срабатывания",
      b: "все перечисленные",
      c: "при применении оборудования с функциями, повышающими достоверность обнаружения пожара (указанные функции должны быть подтверждены эксплуатационными документами на оборудование)",
    },
    description: "п. 15.4 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "На каком минимальном расстоянии от вентиляционных отверстий допускается устанавливать точечные тепловые и дымовые пожарные извещатели?",
    answers: {
      a: "0.7 м",
      b: "1 м",
      c: "0.5 м",
    },
    description: "п. 12.3.12 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Допускается ли увеличивать расстояние, между ПИ и от ПИ до стены при установке точечных ПИ в самом высоком месте наклонного потолка?",
    answers: {
      a: "допускается из расчета 0.5 % на каждый 1° наклона, но не более 35 %",
      b: "допускается из расчета 1 % на каждый 1° наклона, но не более 25 %",
      c: "допускается из расчета 0.5 % на каждый 1° наклона, но не более 30 %",
    },
    description: "п. 12.3.13 СН 2.02.03-2019",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Каково максимальное расстояние между приборами ППКП, ППУ при их вертикальном размещении?",
    answers: {
      a: "не нормируется",
      b: "500 мм",
      c: "200 мм",
    },
    description: "п. 13.3 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Каков физический принцип действия извещателя ИП-104?",
    answers: {
      a: "с использованием плавких или сгораемых вставок",
      b: "с использованием зависимости магнитной индукции от температур",
      c: "с использованием зависимости модуля упругости от температур",
    },
    description: "Приложение А СТБ 2218-2011",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Каково минимальное расстояние от РПИ до органов управления различным электрооборудованием (выключателей, переключателей)?",
    answers: {
      a: "0.25 м",
      b: "0.75 м",
      c: "0.5 м",
    },
    description: "п. 12.10.2 СН 2.02.03-2019",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Какие требования предъявляются к ПИ, применяемым для обнаружения загорания в пространстве над подвесным потолком?",
    answers: {
      a: "ПИ должны быть подключены к самостоятельным шлейфам и иметь выносную оптическую индикацию либо быть адресными",
      b: "нет специфических требований",
      c: "запрещена установка ПИ",
    },
    description: "п. 12.3.19 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
];

let toData = [
  {
    question: "Произвольное срабатывание систем ПА-...",
    answers: {
      a: "срабатывание систем ПА, которое происходит при отсутствии опасных факторов пожара и (или) контролируемых изменений состояния систем ПА или их элементов",
      b: "срабатывание систем ПА, которое происходит при неработоспособном состояния систем ПА и при отсутствии опасных факторов пожара",
      c: "срабатывание систем ПА, которое происходит при отсутствии опасных факторов пожара",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения 1, пункт 2",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "С какой периодичностью осуществляется обучение, повышение квалификации работников лицензиата, осуществляющего техническое обслуживание УПА?",
    answers: {
      a: "по мере необходимости, но не реже одного раза в пять лет",
      b: "не реже одного раза в три года",
      c: "не реже одного раза в пять лет",
    },
    description:
      "Инструкция «О порядке обучения (повышения квалификации) и оценки знаний работников соискателей лицензии на осуществление деятельности по обеспечению пожарной безопасности, лицензиатов, осуществляющих деятельность по обеспечению пожарной безопасности» утверждено постановлением Министерства по чрезвычайным ситуациям Республики Беларусь от 14 декабря 2022 г. № 79 Пункт 6",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Кто заверяет работы (операции) зафиксированные в журнале регистрации работ (операций) при техническом обслуживании системы ПА?",
    answers: {
      a: "лицо, проводившее работы (операции) при техническом обслуживании систем ПА",
      b: "все перечисленные",
      c: "представитель заказчика",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 20",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Допускается ли лицензиату принимать на техническое обслуживание системы ПА, требующие капитального ремонта либо модернизации?",
    answers: {
      a: "допускается",
      b: "не допускается",
      c: "допускается после проведения капитального ремонта либо модернизации систем ПА",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения 1, пункт 16",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Каждое средство обеспечения пожарной безопасности и пожаротушения, подлежащее обязательной оценке соответствия, перед установкой (применением) в составе систем ПА должно:",
    answers: {
      a: "пройти входной контроль и идентификацию",
      b: "пройти входной контроль",
      c: "пройти идентификацию",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 4",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "В течение какого времени лицензиат обязан обеспечить прибытие уполномоченных лиц на обслуживаемый объект находящийся в населённом пункте или городе, за исключением областных центров и г. Минска?",
    answers: {
      a: "семи часов после поступления соответствующего сообщения",
      b: "трех часов после поступления соответствующего сообщения",
      c: "трех часов после отказа, неработоспособности и произвольных срабатываний",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения 1, пункт 18",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "В течение какого времени лицензиат обязан обеспечить прибытие уполномоченных лиц на обслуживаемый объект находящийся в г. Минске или областном центре в случае отказа системы ПА",
    answers: {
      a: "трех часов после поступления соответствующего сообщения",
      b: "семи часов после поступления соответствующего сообщения",
      c: "трех часов после отказа, неработоспособности и произвольных срабатываний",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения 1, пункт 18",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Восстановление систем ПА - это...",
    answers: {
      a: "процесс перевода систем ПА из неработоспособного в работоспособное состояние",
      b: "процесс перевода систем ПА в работоспособное состояние из неработоспособного состояния в соответствии с требованиями ТНПА",
      c: "процесс перевода систем ПА в работоспособное состояние из неисправного состояния",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения1. пункт 2",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "В каком документе учиняется запись о факте прохождения продукцией входного контроля, в ходе которого не установлено несоответствий?",
    answers: {
      a: "в паспорте системы ПА",
      b: "все перечисленные",
      c: "в эсплуатационном документе такой продукции",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 4",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Какова периодичность проведения работ (операций) Регламента № 1, когда такая периодичность не установлена эксплуатационными документами?",
    answers: {
      a: "не реже одного раза в месяц, если такая периодичность не установлена эксплуатационными документами",
      b: "ежемесячно, если такая периодичность не установлена эксплуатационными документами",
      c: "не реже одного раза в три месяца, если такая периодичность не установлена эксплуатационными документами",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 10, подпункт 10.1",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Неработоспособное состояние (неработоспособность) систем ПА или их элементов -",
    answers: {
      a: "состояние систем ПА или их элементов, при котором значение всех параметров, характеризующих способность выполнять заданные функции, не соответствует требованиям технических нормативных правовых актов, эксплуатационных документов и проектной документации",
      b: "состояние ПА при котором значения хотя бы одного параметра, характеризующего способность выполнять заданные функции, соответствует требованиям ТНПА и (или) конструкторской (проектной) документации",
      c: "состояние систем ПА или их элементов, при котором значение хотя бы одного параметра, характеризующего способность выполнять заданные функции, не соответствует требованиям технических нормативных правовых актов, эксплуатационных документов и проектной документации",
    },
    description:
      "Постановление Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 2",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В каких объемах работ (операций) регламентов технического обслуживания должна проводиться проверка работоспособности местного, дистанционного, автоматического пуска пожарных насосов УПА, автоматического включения резервного пожарного насоса при аварийном отключении рабочего пожарного насоса, автоматического перехода на резервный источник электропитания при отключении основного?",
    answers: {
      a: "в объеме Регламента №1",
      b: "все перечисленные",
      c: "в объеме Регламента №2",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 10, подпункт 10.1, 10.2",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Кто осуществляет проведение контроля (планового, внепланового) за качеством выполнения работ и (или) оказания услуг по техническому обслуживанию систем ПА?",
    answers: {
      a: "ответственное лицо (лица) из числа технических руководителей, назначенное (-ые) приказом руководителя лицензиата с обязательным привлечением представителя заказчика",
      b: "инженерно-технический (ие) работник(и), назначенный (-ые) приказом руководителя лицензиата",
      c: "ответственное лицо (лица) из числа технических руководителей, назначенное (-ые) приказом руководителя лицензиата",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 5",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "С какой периодичностью должен осуществляться плановый контроль за качеством выполнения работ и (или) оказания услуг по техническому обслуживанию систем ПА?",
    answers: {
      a: "не реже одного раза в полугодие",
      b: "не реже одного раза в год",
      c: "не реже одного раза в квартал",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 5",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Какая документация должна быть оформлена лицензиатом на каждую систему ПА и передана заказчику при приеме на техническое обслуживание систем ПА?",
    answers: {
      a: "все перечисленные",
      b: "журнал регистрации работ (операций) при техническом обслуживании системы ПА, журнал учета сообщений, паспорт системы ПА и приложения к нему",
      c: "принципиальные схемы УПА, перечень защищаемых системой ПА помещений и зон контроля, инструкция по эксплуатации системы ПА и порядке действий оперативного (дежурного) персонала заказчика при получении сигнала на ППУ и (или) ППКП системы ПА",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 19",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "В каком случае лицензиат вправе приостановить техническое обслуживание системы ПА или ее элементов (в пределах зоны их контроля)?",
    answers: {
      a: "в случае неустранения в течение тридцати дней со дня приема на техническое обслуживание систем ПА указанных в акте первичного обследования системы пожарной автоматики нарушений работоспособности систем ПА и их элементов по независящим от лицензиата обстоятельствам",
      b: "в случае невыполнения заказчиком договорных обязательств либо возникновения других независящих от лицензиата обстоятельств, повлекших неработоспособность системы ПА и ее элементов на срок более пяти календарных дней",
      c: "все перечисленные",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 22",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В каком порядке должно осуществляться лицензиатом техническое обслуживание систем ПА - ...",
    answers: {
      a: "в плановом или внеплановом порядке",
      b: "в плановом порядке",
      c: "в плановом и внеплановом порядке",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения 1, пункт 8",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Сведения о замене элементов систем ПА должны быть внесены?",
    answers: {
      a: "в паспорт системы пожарной автоматики и в проектную документацию",
      b: "в паспорт системы пожарной автоматики",
      c: "в проектную документацию",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 15",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "В каких объемах работ (операций) регламентов технического обслуживания должна проводиться проверка напряжения и остаточной емкости резервного источника питания систем ПА и их элементов при отсутствии оригиналов (копий) эксплуатационных документов на элементы систем ПА?",
    answers: {
      a: "в объеме Регламента №1",
      b: "в объеме Регламента №2",
      c: "все перечисленные",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1 Пункт 10 Подпункты 101, 10.2",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В каком документе указываются факты неработоспособности систем ПА, выявленные в ходе первичного обследования этих систем ?",
    answers: {
      a: "Акт на выполненные работы по первичному обследованию систем",
      b: "Акт первичного обследования системы пожарной автоматики",
      c: "Дефектная ведомость",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 16",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Какие специалисты дополнительно к общим требованиям должны быть в штате лицензиата для проведения работ по техническому обслуживания УПА?",
    answers: {
      a: "не менее одного монтажника санитарно-технических систем и оборудования либо монтажника гидроагрегатов, электрогазосварщика",
      b: "электрогазосварщик",
      c: "не менее одного монтажника санитарно-технических систем и оборудования либо монтажника гидроагрегатов",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В какой срок лицензиат обязан письменно проинформировать соответствующий территориальный орган по чрезвычайным ситуациям о случаях невозобновления технического обслуживания после истечения тридцати календарных дней со дня приостановления технического обслуживания системы ПА или ее элементов?",
    answers: {
      a: "не позднее трех рабочих дней",
      b: "не позднее двух рабочих дней",
      c: "не позднее пяти рабочих дней",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 22",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Когда фиксируется факт приостановления технического обслуживания в журнале регистрации работ (операций) при техническом обслуживании систем ПА ?",
    answers: {
      a: "не позднее двух рабочих дней с момента приостановления технического обслуживания системы ПА или ее элементов",
      b: "в день подписания акта приостановления технического обслуживания системы ПА или ее элементов",
      c: "в день приостановления технического обслуживания системы ПА или ее элементов",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, Пункт 22",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Может ли заказчик самостоятельно устранять причины, послужившие отказу, неработоспособности и произвольным срабатываниям систем ПА, а также приводить эти системы в работоспособное состояние?",
    answers: {
      a: "допускается при условии, что порядок действий лицензиата и заказчика, сроки устранения заказчиком причин, ответственность лицензиата и заказчика регламентированы договором на техническое обслуживание систем ПА",
      b: "все перечисленные",
      c: "допускается в случае, когда устранение причин, которые привели к отказу, неработоспособности и произвольным срабатываниям систем ПА, а также приведение этих систем в работоспособное состояние может быть оперативно осуществлено заказчиком самостоятельно",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» приложение 1, пункт 18",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Могут ли приниматься на техническое обслуживание лицензиатом системы ПА, требующие текущего ремонта?",
    answers: {
      a: "не могут",
      b: "могут после проведения текущего ремонта",
      c: "могут",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения 1, пункт16",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Замена элементов систем ПА, отличных по характеристикам и параметрам, предусмотренным проектной документацией на систему ПА, осуществляется...",
    answers: {
      a: "на основании проектной документации, разработанной в установленном законодательством порядке",
      b: "на основании эксплуатационных документов",
      c: "на основании паспорта системы",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 15",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "В каком журнале указываются сведения о проведении первичного и повторного инструктажей оперативного (дежурного) персонала заказчика?",
    answers: {
      a: "журнал регистрации работ по техническому обслуживанию и текущему ремонту",
      b: "журнал учета сообщений",
      c: "журнала регистрации работ (операций) при техническом обслуживании системы пожарной автоматики",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, Пункт 24",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Установка пожаротушения автоматическая - это...",
    answers: {
      a: "установка пожаротушения автоматическая, оснащенная техническими средствами обнаружения очага возгорания и управления выпуском огнетушащего вещества в зону пожара",
      b: "установка пожаротушения, обеспечивающая подачу (выпуск) огнетушащего вещества при поступлении управляющего сигнала от системы пожарной сигнализации либо собственных технических средства обнаружения возгорания без участия человека, а также передачу сигнала о пожаре во внешние цепи",
      c: "установка пожаротушения автоматическая, функционирующая независимо от внешних источников питания и систем управления и обеспечивающая передачу сигнала о пожаре во внешние цепи",
    },
    description:
      "Технический регламент Евразийского экономического союза О требованиях к средствам обеспечения пожарной безопасности и пожаротушения (ТР ЕАЭС 043/2017) Пункт 6",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Эксплуатационные документы систем ПА и (или) их элементов - это...",
    answers: {
      a: "документы, определяющие правила эксплуатации систем ПА и (или) элементов этих систем в течение установленного срока эксплуатации",
      b: "документы, определяющие правила эксплуатации систем ПА и (или) элементов этих систем в течение установленного срока службы, но не менее 10 лет",
      c: "документы, определяющие правила эксплуатации систем ПА и (или) их элементов в течение установленного срока службы",
    },
    description:
      "Постановление Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 2",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В каких случаях лицензиат обязан проводить первичный инструктаж оперативного (дежурного) персонала заказчика о порядке действий при получении сигнала на прибор управления пожарный и (или) прибор приемно-контрольный пожарный системы ПА?",
    answers: {
      a: "перед приемом систем ПА на техническое обслуживание",
      b: "при проведении первичного обследования систем ПА",
      c: "при приеме систем ПА на техническое обслуживание",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 24",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Допускается ли при техническом обслуживании систем ПА уничтожение (удаление) электронного журнала событий приборов приемно-контрольных и управления?",
    answers: {
      a: "допускается при условии копировании и обеспечения ее хранения не менее 12 месяцев информации журнала событий приборов приемно-контрольных и управления",
      b: "не допускается",
      c: "допускается",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 23",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Когда должно проводиться внеплановое техническое обслуживание систем ПА?",
    answers: {
      a: "при выдаче обслуживаемыми лицензиатом системами ПА трех и более произвольных срабатываний в одной и той же зоне контроля в течение календарного месяца, либо по решению заказчика, либо после текущего ремонта",
      b: "при выдаче обслуживаемых лицензиатом систем ПА пяти и более произвольных срабатываний в одной и той же зоне контроля в течение месяца, либо по решению заказчика, либо после текущего ремонта",
      c: "при выдаче обслуживаемых лицензиатом систем ПА трех и более произвольных срабатываний в одной и той же зоне контроля в течение календарного месяца, либо по решению заказчика, либо после капитального ремонта",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения 1, пункт 14",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "В каком документе приведен перечень оборудования, приборов (средств измерения) и инструментов, необходимых для выполнения работ и (или) оказания услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности?",
    answers: {
      a: "постановление МЧС Республики Беларусь от 09.12.2022 №75",
      b: "ТКП 316-2011",
      c: "постановление МЧС Республики Беларусь от 09.12.2022 №76",
    },
    description:
      "Постановление МЧС РБ от 09.12.2022 №75 О перечне оборудования, приборов (средств измерения) и инструментов",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Допускается ли использовать сокращения наименования видов работ (операций) при их фиксации в рамках технического обслуживания систем ПА:",
    answers: {
      a: "допускается при наличии их полных расшифровок в паспорте системы пожарной автоматики",
      b: "допускается при наличии их полных расшифровок в журнале регистрации работ (операций) при техническом обслуживании систем пожарной автоматики",
      c: "не допускается",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 18",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Работоспособное состояние (работоспособность) систем ПА или их элементов -",
    answers: {
      a: "состояние ПА при котором значения хотя бы одного параметра, характеризующего способность выполнять заданные функции, не соответствует требованиям ТНПА и (или) конструкторской (проектной) документации",
      b: "состояние ПА при котором они соответствуют всем требованиям ТНПА и (или) конструкторской (проектной) документации и обеспечивается работоспособность системы",
      c: "состояние систем ПА или их элементов, при котором они способны выполнять заданные функции с сохранением значений параметров в пределах, установленных требованиями",
    },
    description:
      "Постановление Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения 1, пункт 2",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Какие журналы оформляются лицензиатом и передаются заказчику при приеме на техническое обслуживание систем ПА?",
    answers: {
      a: "журнал регистрации работ (операций) при техническом обслуживании системы ПА, журнал учета сообщений",
      b: "журнал регистрации работ по техническому обслуживанию и текущему ремонту; журнал учета сообщений",
      c: "журнал регистрации работ по техническому обслуживанию и текущему ремонту; журнал учета вызовов",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 19",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "В какой срок лицензиатом должны быть устранены выявленные в ходе технического обслуживания систем ПА неработоспособности систем ПА и их элементов либо повреждения систем ПА и их элементов, повреждения креплений элементов систем ПА и соединительных линий?",
    answers: {
      a: "втечение десяти календарных дней со дня их выявления",
      b: "в течение трех календарных дней со дня их выявления",
      c: "втечение пяти календарных дней со дня их выявления",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения 1, пункт12",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В каких случаях, выявленных в ходе входного контроля, продукция не допускается к применению и (или) установке в системах ПА?",
    answers: {
      a: "все перечисленные",
      b: "в случае несоответствия ее качества и комплектности эксплуатационным документам, либо документам об оценке соответствия, либо сведениям, содержащимся в указанных документах и на маркировке этой продукции",
      c: "в случае ее несоответствия продукции, указанной в проектной документации (при ее наличии) на системы ПА",
    },
    description:
      "Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности Приложения 1, пункт 4",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Плановое техническое обслуживание систем ПА должно проводиться",
    answers: {
      a: "в объеме, с периодичностью и с применением способов, установленных эксплуатационными документами систем ПА и (или) их элементов, и в соответствии с регламентом проведения технического обслуживания, разработанным лицензиатом на каждую систему ПА в отдельности с учетом установленных требований, и согласованным с заказчиком",
      b: "в объеме и с периодичностью, с применением способов, установленными паспортами систем ПА и (или) их элементов, и в соответствии с регламентом проведения технического обслуживания, разработанным лицензиатом на каждую систему ПА в отдельности с учетом установленных требований, и согласованным с заказчиком",
      c: "в объеме и с периодичностью в соответствии с регламентом проведения технического обслуживания, разработанным заказчиком на каждую систему ПА в отдельности с учетом установленных требований, и согласованным с заказчиком",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения 1, пункт 9",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Кто проводит актуализацию сведений, содержащихся в паспорте системы пожарной автоматики и приложениях к нему в случае изменения этих сведений в течение срока выполнения работ и (или) оказания услуг по техническому обслуживанию систем ПА?",
    answers: {
      a: "заказчик",
      b: "все перечисленные",
      c: "лицензиат, осуществляющий техническое обслуживание систем ПА",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 19",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Сколько специалистов должно быть в штате лицензиата для выполнения работ и (или) оказания услуг по техническому обслуживанию систем УПА ?",
    answers: {
      a: "не менее одного технического руководителя, не менее двух электромонтеров ОПС, не менее одного монтажника санитарно-технических систем и оборудования либо монтажника гидроагрегатов",
      b: "не менее трех электромонтеров ОПС",
      c: "инженерно-технический работник, не менее трех электромонтеров ОПС, не менее двух монтажников санитарно-технических систем и оборудования либо монтажников гидроагрегатов",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "При выполнении работ и (или) оказании услуг по техническому обслуживанию систем ПА и их элементов ...?",
    answers: {
      a: "не допускается",
      b: "допускается использовать оборудование, приборы (средства измерения) и инструменты, предусмотренные эксплуатационными документами на эти элементы",
      c: "допускается использовать оборудование, приборы (средства измерения) и инструменты, предусмотренные эксплуатационными документами на эти элементы только по согласованию с заказчиком не допускается использовать оборудование, приборы (средства измерения) и инструменты, предусмотренные эксплуатационными документами на эти элементы",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 6",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Кто при техническом обслуживании систем ПА осуществляет организацию и обеспечивает проверку качества пенообразователя (рабочих растворов пенообразователей), используемого в УПА, испытаний элементов УПА?",
    answers: {
      a: "заказчик",
      b: "лицензиат либо заказчик в соответствии с договором на техническое обслуживание систем ПА",
      c: "лицензиат",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 13",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Внеплановое техническое обслуживание проводится в объеме работ (операций)?",
    answers: {
      a: "Регламентов №1, №2",
      b: "Регламента №2",
      c: "Регламента №1",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт14",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Текущий ремонт систем ПА -",
    answers: {
      a: "ремонт, включающий восстановление или замену элементов систем ПА на предусмотренные проектной документацией элементы",
      b: "ремонт, выполняемый для восстановления исправности и частичного восстановления ресурса ПА с заменой или восстановлением отдельных составных частей ограниченной номенклатуры и контролем технического состояния составных частей, выполняемом в объеме, установленном в ТНПА",
      c: "ремонт, выполняемый для восстановления исправности и полного или близкого к полному восстановлению ресурса ПА с заменой или восстановлением любых ее (его) частей",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения 1, пункт 2",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Какая периодичность проведения работ (операций) Регламента № 2, если такая периодичность не установлена эксплуатационными документами?",
    answers: {
      a: "не реже одного раза в пол года",
      b: "не реже одного раза в квартал",
      c: "не реже одного раза в три месяца",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1 пункта 10 подпункт 10.2",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "Кто обязан проводить инструктаж оперативного (дежурного) персонала заказчика о порядке действий при получении сигнала на прибор управления пожарный и (или) прибор приемно-контрольный пожарный системы ПА?",
    answers: {
      a: "заказчик",
      b: "не требуется",
      c: "лицензиат",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 24",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "С какой целью лицензиатом осуществляется оказание услуг по техническому обслуживанию систем ПА?",
    answers: {
      a: "для поддержания систем ПА и их элементов в работоспособном состоянии при эксплуатации",
      b: "для поддержания исправного состояния систем ПА и их элементов при эксплуатации",
      c: "для поддержания систем ПА и их элементов в работоспособном и исправном состоянии при эксплуатации",
    },
    description:
      "Постановление Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 7",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "В течении какого времени после заключения договора на техническое обслуживание систем ПА лицензиат должен провести первичное обследование систем ПА?",
    answers: {
      a: "в течении пяти календарных дней",
      b: "в течении трех календарных дней",
      c: "в течении пяти рабочих дней",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения 1, пункт 16",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "При возникновении пожара на объекте, расположенном в г. Минске и областных центрах, на котором лицензиат осуществляет техническое обслуживание систем ПА, и поступлении сообщения от заказчика лицензиат обязан обеспечить прибытие подчиненных работников на этот объект в сроки:",
    answers: {
      a: "в течение семи часов после поступления соответствующего сообщения",
      b: "по согласованию с заказчиком",
      c: "в течение трех часов после поступления соответствующего сообщения",
    },
    description:
      "Постановление Совета Министров Республики Беларусь от 10 апреля 2023 г. № 234 Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности. Приложение 1, пункт 18",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Внешний влияющий фактор — ...",
    answers: {
      a: "природно-климатические, радиочастотные и другие помехи, которые могут повлиять на работоспособность систем ПА и (или) их элементов",
      b: "природно-климатические, промышленные и другие помехи, которые могут повлиять на работоспособность систем ПА и (или) их элементов",
      c: "природно-климатические, электромагнитные и другие помехи, которые могут повлиять на работоспособность систем ПА и (или) их элементов",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложения 1, пункт 2",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "В каком порядке лицензиат принимает участие в проведении технического освидетельствования систем ПА?",
    answers: {
      a: "установленном представителем Заказчика",
      b: "установленном договором на техническое обслуживание систем ПА",
      c: "установленном эксплуатационной документацией на системы ПА",
    },
    description:
      "Постановления Совета Министров Республики Беларусь «Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности» Приложение 1, пункт 17",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "В каких обьемах работ (операций) регламентов технического обслуживания должна проводиться проверка синхронизации времени и даты, утсановленных в приборах управления пожарных и (или) приборах приерно-контрольных пожарных, с фактическими?",
    answers: {
      a: "Все перечисленные",
      b: "В обьеме регламента №2",
      c: "В обьеме Регламента №1",
    },
    description:
      "прил.1.п.10 пп 10.2 10.1 Постановления Сов.Мина РБ Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Кто при техническом обслуживании систем ПА осуществляет организацию и обеспечивает измерение электрического сопротивления соединительных линий систем ПА?",
    answers: {
      a: "Лицензиат либо заказчик в соответствии с договором на техническое обслуживание систем ПА",
      b: "Заказчик",
      c: "Лицензиат ",
    },
    description:
      "прил.1.п.13 Постановления Сов.Мина РБ Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "В каких обьемах работ (операций) регламентов технического обслуживания должна проводиться проверка напряжения и остаточной емкости резервного источника питания систем ПА и их элементов при отсутсвии оригиналов (копий) эксплуатационных документов на элементы систем ПА?",
    answers: {
      a: "Все перечисленные",
      b: "В обьеме регламента №2",
      c: "В объёме Регламента №1",
    },
    description:
      "прил.1.п.10 пп 10.1 10.2 Постановления Сов.Мина РБ Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Кто обязан проводить инструктаж оперативного (дежурного) персонала заказчика о прядке действий при получении сигнала на прибор управления пожарной и (или) прибор приемно-контрольный пожарный систем ПА?",
    answers: {
      a: "Заказчик",
      b: "Лицензиат",
      c: "Не требуется",
    },
    description:
      "прил.1.п.24 Постановления Сов.Мина РБ Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "С какой периодичностью осуществляется обучение, повышение квалификации работников лицензиата, осуществляющего техническое обслуживание СПС?",
    answers: {
      a: "Не реже одного раза в три года",
      b: "Не реже одного раза в пять лет",
      c: "По мере необходимости, но не реже одного раза в пять лет",
    },
    description:
      "пункт 6 Инструкции МЧС «Об обучении…» от 14 декабря 2022г. № 79",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В каких объёмах работ (операций) регламентов технического обслуживания должна проводиться проверка показаний и работоспособности измерительных устройств (приборов) система ПА?",
    answers: {
      a: "Все перечисленные",
      b: "В объёме Регламента №1",
      c: "В объёме Регламента №2",
    },
    description:
      "прил.1.п.10 пп 10.1 10.2 Постановления Сов.Мина РБ Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Сколько специалистов должно быть в штате лицензиата для выполнения работ и (или) оказания услуг по техническому обслуживанию СПС?",
    answers: {
      a: "Не менее трех электромонтеров ОПС",
      b: "Инженерно-технический работник и не менее трех электромонтеров ОПС",
      c: "Не менее одного технического руководителя и не менее двух электромонтеров ОПС",
    },
    description:
      "прил.1.п.3 Постановления Сов.Мина РБ Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "Система пожарной автоматики в соответствии с ТР ЕАЭС 043/2017-это...",
    answers: {
      a: "Совокупность взаимодействующих систем пожарной сигнализации, передачи извещений о пожаре, оповещения и управления эвакуацией людей, противодымной вентиляции, предназначенных для обеспечения пожарной безопасности объекта",
      b: "Совокупность взаимодействующих систем пожарной сигнализации, передачи извещений о пожаре, оповещения и управления эвакуацией людей, противодымной вентиляции, установок автоматического пожаротушения и иного оборудования автоматической противопожарной защиты, предназначенных для обеспечения пожарной безопасности объекта",
      c: "Совокупность взаимодействующих систем пожарной сигнализации, передачи извещений о пожаре, противодымной вентиляции, установок автоматического пожаротушения и иного оборудования автоматической противопожарной защиты, предназначенных для обеспечения пожарной безопасности объекта",
    },
    description: "п.6 ТР.ЕАЭС 043/2017",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "В каких объёмах работ (операций) регламентов технического обслуживания должна проводиться чистка наружных и внутренних поверхностей элементов систем ПА?",
    answers: {
      a: "В объёме Регламента №1",
      b: "Объёме Регламента №2",
      c: "Все перечисленные",
    },
    description:
      "прил.1.п.10 пп 10.1 10.2 Постановления Сов.Мина РБ Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Ремонт систем ПА-...",
    answers: {
      a: "Совокупность работ по восстановлению утраченных в процессе эксплуатации технических качеств систем ПА или их элементов, проводимых для обеспечения их работоспособности",
      b: "Совокупность работ по восстановлению утраченных в процессе эксплуатации технических качеств систем ПА или их элементов, проводимых для обеспечения их работоспособности и исправности",
      c: "Работы, выполняемые для восстановления утраченных в процессе эксплуатации технических качеств систем ПА или их элементов, проводимых для обеспечения их работоспособности",
    },
    description:
      "прил.1.п.2 Постановления Сов.Мина РБ Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "В каких объёмах работ (операций) регламентов технического обслуживания должна проводиться проверка прохождения сигналов, предусмотренных функциональными возможностями систем ПА и проектной документацией, на пункт диспетчеризации пожарной автоматики, а также на приборы управления пожарные и (или) проборы приемно-контрольные пожарные от элементов систем ПА по каждой соединительной линии?",
    answers: {
      a: "Объёме Регламента №2",
      b: "Все перечисленные",
      c: "В объёме Регламента №1",
    },
    description:
      "прил.1.п.10 пп 10.1 10.2 Постановления Сов.Мина РБ Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пожарной безопасности",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Система оповещения и управления эвакуацией людей при пожаре по ТР ЕАЭС 043/2017, это...",
    answers: {
      a: "Совокупность технических средств, предназначенных для информирования людей о возникновении пожара, необходимости эвакуироваться, путях и очередности эвакуации",
      b: "Устройство формирования, преобразования, передачи и воспроизведения электрических сигналов (световых, звуковых, речевых) в одном или нескольких видах, непосредственно воспринимаемых человеком",
      c: "Совокупность технических средств, предназначенных для сообщения людям информации о возникновении пожара или другой чрезвычайной ситуации, и порядке действий при эвакуации",
    },
    description: "Р 2.п 6 ТР ЕАЭС 043/2017",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Предельно допустимый уровень звукового давления звуковых оповещателей в защищаемых СО помещениях, где люди находятся в шумозащитном снаряжении, или в помещениях с уровнем фона шума более 95 дБ, не должен превышать:",
    answers: {
      a: "120 дБ",
      b: "100 дБ",
      c: "110 дБ",
    },
    description: "п.12.12.9 СН 2.02.03-2019",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Сколько специалистов должно быть в штате лицензиата для выполнения работ и (или) оказания услуг по техническому обслуживанию СО?",
    answers: {
      a: "не менее одного технического руководителя и не менее двух электромонтеров ОПС",
      b: "инженерно-технический работник и не менее трех электромонтеров ОПС",
      c: "не менее трех электромонтеров ОПС",
    },
    description:
      "прил.1 п.3 Постановление Сов. Мин-а РБ Об определении требований к выполнению работ и оказанию услуг, состовляющих лицензируемую деятельность по обеспчению пож.без.",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question: "Звуковой сигнал звукового оповещателя должен обеспечивать:",
    answers: {
      a: "быть отличным от других сигналов",
      b: "однозначное восприятие",
      c: "однозначное восприятие и быть отличным от других сигналов",
    },
    description: "СТБ 2243-2011 пп. 5.3.1",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В каких объемах работ (операций) регламентов технического обслуживания должна проводиться проверка уровня звукового давления, создаваемого СО и отдельными ее элементами, установленного ТНПА, эксплуатационными документами и (или) проектной документацией?",
    answers: {
      a: "все перечисленные",
      b: "в объеме Регламента №1",
      c: "объеме Регламента №2",
    },
    description:
      "прил.1 п.10 пп.10.1 10.2 Постановление Сов. Мин-а РБ Об определении требований к выполнению работ и оказанию услуг, состовляющих лицензируемую деятельность по обеспчению пож.без.",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: 
      "Дымовая зона - это... (дать определение)",
    answers: {
      a: "помещение или часть помещения площадью не более 2000 м2, из которого удаляется дымовая смесь в объеме, обеспечивающем безопасную эвакуацию людей при пожаре",
      b: "помещение площадью не более 3000 м2, из которого удаляется дымовая смесь в объеме, обеспечивающем безопасную эвакуацию людей при пожаре",
      c: "помещение или часть помещения площадью не более 3000 м2, из которого удаляется дымовая смесь в объеме, обеспечивающем безопасную эвакуацию людей при пожаре",
    },
    description: "п.3.6 СН 2.02.07-2020",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question:
      "В каких объемах работ (операций) регламентов технического обслуживания должна проводиться выборочная проверка срабатывания (включения, отключения) сблокированных инженерных систем и оборудования от систем ПА?",
    answers: {
      a: "все перечисленные",
      b: "в объеме Регламента №1",
      c: "в объеме Регламента №2",
    },
    description:
      "прил.1 п.10 пп.10.2 10.1 Постановление Сов. Мин-а РБ Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пож. без.",
    correctAnswer: "a",
    userAnswer: null,
  },
  {
    question:
      "Сколько специалистов должно быть в штате лицензиата для выполнения работ и (или) оказания услуг по техническому обслуживанию систем СПДВ?",
    answers: {
      a: "не менее трех электромонтеров ОПС",
      b: "не менее одного технического руководителя, не менее двух электромонтеров ОПС, не менее одного слесаря по ремонту и обслуживанию систем вентиляции и кондиционирования либо монтажника систем вентиляции и пневмотранспорта",
      c: "инженерно-технический работник, не менее трех электромонтеров ОПС, не менее двух слесарей по ремонту и обслуживанию систем вентиляции и кондиционирования либо двух монтажников систем вентиляции и пневмотранспорта",
    },
    description:
      "прил.1 п.3 Постановление Сов. Мин-а РБ Об определении требований к выполнению работ и оказанию услуг, составляющих лицензируемую деятельность по обеспечению пож. без.",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question: "Дымовой клапан это... (дать определение)",
    answers: {
      a: "проем или отверстие канала системы вытяжной противодымной вентиляции с установленной в нем сеткой, или решеткой, или дымовым люком, или нормально закрытым противопожарным клапаном",
      b: "нормально закрытый противопожарный клапан с нормируемым пределом огнестойкости, устанавливаемый непосредственно в шахтах и воздуховодах систем противодымной вентиляции",
      c: "автоматически и дистанционно управляемое устройство, перекрывающее проемы в наружных ограждающих конструкциях помещений, защищаемых вытяжной противодымной вентиляцией с естественным побуждением тяги",
    },
    description: "п.3.7 СН 2.02.07-2020",
    correctAnswer: "b",
    userAnswer: null,
  },
  {
    question:
      "С какой периодичностью осуществляется обучение, повышение квалификации работников лицензиата, осуществляющего техническое обслуживание СПДВ?",
    answers: {
      a: "не реже одного раза в три года",
      b: "не реже одного раза в пять лет",
      c: "по мере необходимости, но не реже одного раза в пять лет",
    },
    description:
      "п.6 Инструкции О Порядке обучения (повышения квалификации) и оценки знаний работников соискателей лицензии на осуществление деятельности по обеспечению пож.без., лицензиатов осуществляющих деятльность по обпеспечению пож.без. № 79 от 14.12.2022",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Дымоприемное устройство- это... (дать определение)",
    answers: {
      a: "нормально закрытый противопожарный клапан, имеющий предельное состояние по огнестойкости, характеризуемое только потерей плотности, и подлежащий установке непосредственно в проемах дымовых вытяжных шахт в защищаемых коридорах",
      b: "автоматически и дистанционно управляемое устройство, перекрывающее проемы в наружных ограждающих конструкциях помещений, защищаемых вытяжной противодымной вентиляцией с естественным побуждением тяги",
      c: "проем или отверстие в воздуховоде или шахте системы вытяжной противодымной вентиляции с установленной в них сеткой (решеткой), или дымовым люком (дымовым клапаном), или фрамугой",
    },
    description: "СН. 2.02.07-2020 п. 3.4",
    correctAnswer: "c",
    userAnswer: null,
  },
  {
    question: "Система противодымной вентиляции по ТР ЕАЭС 043/2017, это...",
    answers: {
      a: "автоматически и дистанционно управляемая вентиляционная система, предназначенная для удаления продуктов горения при пожаре через дымоприемное устройство или дымовой люк наружу здания",
      b: "совокупность технических средств, предназначенных для предотвращения или ограничения опасности задымления зданий и сооружений при пожаре",
      c: "совокупность взаимодействующих технических средств, предназначенных для предотвращения или ограничения опасности задымления зданий и сооружений при пожаре, а также воздействия опасных факторов пожара на людей и материальные ценности",
    },
    description: "ТР ЕАЭС 043/2017 раз. 2 п. 6",
    correctAnswer: "c",
    userAnswer: null,
  },
];

const montazhNaladkaTestsButton = document.getElementById("montaz-naladka-tests");
const toTestsButton = document.getElementById("to-tests");
const title = document.getElementById("title");
const quizContainer = document.getElementById("quiz");
const resultsContainer = document.getElementById("results");
const questionNumber = document.getElementById("question-number");
const nextButton = document.getElementById("next");
const restartButton = document.getElementById("restart");
const examButton = document.getElementById("exam");
const trainingButton = document.getElementById("training");
const modal = document.getElementById("modal");
const modalButton = document.getElementById("modal-button");

let currentQuestion = 0;
let numCorrect = 0;
let testType = "";
let quizData = montazhNaladkaData.slice();
let initialQuizData = quizData.slice();
quizData.sort(() => Math.random() - 0.5);

montazhNaladkaTestsButton.addEventListener("click", startMontazhNaladkaTests);
toTestsButton.addEventListener("click", startToTests);
examButton.addEventListener("click", startExam);
trainingButton.addEventListener("click", startTraining);
modalButton.addEventListener("click", closeModal);

function shuffle(array) {
  for (let i = array.length - 1; i > 0; i--) {
    let j = Math.floor(Math.random() * (i + 1));
    [array[i], array[j]] = [array[j], array[i]];
  }
}

function closeModal() {
  modal.style.display = "none";
}

function startMontazhNaladkaTests() {
  quizData = montazhNaladkaData.slice();
  // shuffle(quizData);
  initialQuizData = quizData.slice();
  montazhNaladkaTestsButton.style.display = "none";
  toTestsButton.style.display = "none";
  examButton.style.display = "inline-block";
  trainingButton.style.display = "inline-block";
  title.innerHTML = "Монтаж и наладка ПА<br>Вопросы МЧС</br>";
}

function startToTests() {
  quizData = toData.slice();
  // shuffle(quizData);
  initialQuizData = quizData.slice();
  montazhNaladkaTestsButton.style.display = "none";
  toTestsButton.style.display = "none";
  examButton.style.display = "inline-block";
  trainingButton.style.display = "inline-block";
  title.innerHTML =
    "Техническое обслуживание пожарной автоматики<br>Вопросы МЧС</br>";
}

function startExam() {
  modal.style.display = "flex";
  modal.style.alignItems = "center";
  testType = "Exam";
  shuffle(quizData);
  const examQuestions = quizData.slice(0, 10);
  setQuizData(examQuestions);
  examButton.style.display = "none";
  trainingButton.style.display = "none";
  nextButton.style.display = "inline-block";
  restartQuiz();
  buildQuiz();
}

function setQuizData(data) {
  quizData.length = 0;
  quizData.push(...data);
}

function startTraining() {
  testType = "Training";
  setQuizData([...initialQuizData]);
  examButton.style.display = "none";
  trainingButton.style.display = "none";
  nextButton.style.display = "inline-block";
  restartQuiz();
  buildQuiz();
}

function buildQuiz() {
  const output = [];
  const currentQuestionData = quizData[currentQuestion];
  const answers = Object.entries(currentQuestionData.answers);

  answers.sort(() => Math.random() - 0.5);

  output.push(
    `<div class="question" style="font-size: large; font-weight: 600; text-align: center"> ${currentQuestionData.question} </div>`
  );

  if (currentQuestionData.image) {
    output.push(
      `<div class="question-image" style="text-align: center; display: flex; flex-direction: column;">
        <img src="${currentQuestionData.image}" alt="question-image" style="max-width: 5em; height: auto; margin: auto; margin-bottom: 1.5em;"
        </div>`
    );
  }

  answers.forEach(([letter, answerText]) => {
    const isCorrect = letter === currentQuestionData.correctAnswer;
    output.push(
      `<button class="answer-button" style="max-width: 50em; text-align: center; font-size: initial" data-letter="${letter}" ${
        currentQuestionData.userAnswer ? "disabled" : ""
      }>
          ${answerText}
        </button>`
    );
  });

  quizContainer.innerHTML = output.join("");
  questionNumber.innerHTML = `Вопрос №${currentQuestion + 1} из ${
    quizData.length
  }`;
}

function showResults() {
  const currentQuestionData = quizData[currentQuestion];
  const userAnswer = currentQuestionData.userAnswer;

  const selectedButton = quizContainer.querySelector(
    `.answer-button[data-letter="${userAnswer}"]`
  );
  selectedButton.disabled = true;

  const correctButton = quizContainer.querySelector(
    `.answer-button[data-letter="${currentQuestionData.correctAnswer}"]`
  );
  correctButton.classList.add("correct");

  if (userAnswer === currentQuestionData.correctAnswer) {
    numCorrect++;
    resultsContainer.innerHTML = '<div style="color: green;">Правильно!</div>';
  } else {
    selectedButton.classList.add("incorrect");
    resultsContainer.innerHTML = `<div style="color: red;">Неправильно!</div><div style="color: red; font-size: small">${currentQuestionData.description}</div>`;
  }
}

function nextQuestion() {
  const allAnswered = quizData.every(
    (question) => question.userAnswer !== null
  );

  if (allAnswered) {
    if (testType == "Exam") {
      if (quizData.length - numCorrect <= 2) {
        quizContainer.innerHTML =
          '<h2 style="color: green; font-size: 2em">Экзамен сдан!</h2>';
        quizContainer.innerHTML += `<h4>Вы ответили правильно на ${numCorrect} из ${quizData.length} вопросов.</h4>`;
      } else {
        quizContainer.innerHTML =
          '<h3 style="color: red; font-size: 2em">Экзамен не сдан!</h3>';
        quizContainer.innerHTML += `<h4>Вы ответили правильно на ${numCorrect} из ${quizData.length} вопросов.</h4>`;
      }
    } else {
      quizContainer.innerHTML = "<h3>Тест завершен!</h3>";
      quizContainer.innerHTML += `<h4>Вы ответили правильно на ${numCorrect} из ${quizData.length} вопросов.</h4>`;
    }

    resultsContainer.innerHTML = " ";
    nextButton.style.display = "none";
    restartButton.style.display = "block";
  } else {
    nextButton.style.display = "block";
    currentQuestion++;
    if (currentQuestion >= quizData.length) {
      currentQuestion = 0;
      while (quizData[currentQuestion].userAnswer !== null) {
        currentQuestion++;
        if (currentQuestion >= quizData.length) {
          currentQuestion = 0;
        }
      }
    }
    buildQuiz();
    resultsContainer.innerHTML = "";
  }
}

function restartQuiz() {
  if (testType !== "Training") {
    quizData.sort(() => Math.random() - 0.5);
  }

  currentQuestion = 0;
  numCorrect = 0;
  quizData.forEach((question) => {
    question.userAnswer = null;
  });
  resultsContainer.innerHTML = "";
  nextButton.style.display = "block";
  restartButton.style.display = "none";
}

nextButton.addEventListener("click", nextQuestion);

restartButton.addEventListener("click", function () {
  montazhNaladkaTestsButton.style.display = "inline-block";
  toTestsButton.style.display = "inline-block";
  examButton.style.display = "none";
  trainingButton.style.display = "none";
  nextButton.style.display = "none";
  restartButton.style.display = "none";
  questionNumber.innerHTML = "";
  quizContainer.innerHTML = "";
  title.innerHTML =
    "Проверка знаний специалистов по монтажу, наладке и техническом обслуживании пожарной автоматики<br>Вопросы МЧС</br";
});

quizContainer.addEventListener("click", function (event) {
  const clickedButton = event.target.closest(".answer-button");
  if (clickedButton) {
    const selectedLetter = clickedButton.getAttribute("data-letter");
    quizData[currentQuestion].userAnswer = selectedLetter;
    showResults();

    // Disable other buttons
    const answerButtons = quizContainer.querySelectorAll(".answer-button");
    answerButtons.forEach((button) => {
      if (button !== clickedButton) {
        button.disabled = true;
        button.style.transform = "none";
        button.style.cursor = "default";
      }
    });
  }
});
